<!DOCTYPE html>
<html lang="en">

<!-- Head tag -->
<head>

    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">

    <!--Description-->
    
        <meta name="description" content="Not every post is provided with an English version (eg. novels)">
    

    <!--Author-->
    
        <meta name="author" content="Roger Luo">
    

    <!--Open Graph Title-->
    
        <meta property="og:title" content="为什么要制造量子计算机"/>
    

    <!--Open Graph Description-->
    
        <meta property="og:description" content="Not every post is provided with an English version (eg. novels)" />
    

    <!--Open Graph Site Name-->
    <meta property="og:site_name" content="Half Integer"/>

    <!--Type page-->
    
        <meta property="og:type" content="article" />
    

    <!--Page Cover-->
    

        <meta name="twitter:card" content="summary" />
    

    <!-- Title -->
    
    <title>为什么要制造量子计算机 - Half Integer</title>

    <!-- Bootstrap Core CSS -->
    <link href="//maxcdn.bootstrapcdn.com/bootstrap/3.3.6/css/bootstrap.min.css" rel="stylesheet"/>

    <!-- Custom CSS -->
    <link rel="stylesheet" href="/css/style.css">

    <!-- Custom Fonts -->
    <link href="//maxcdn.bootstrapcdn.com/font-awesome/4.6.3/css/font-awesome.min.css" rel="stylesheet" type="text/css">
    <link href="//fonts.googleapis.com/css?family=Lora:400,700,400italic,700italic" rel="stylesheet" type="text/css">
    <link href="//fonts.googleapis.com/css?family=Open+Sans:300italic,400italic,600italic,700italic,800italic,400,300,600,700,800" rel="stylesheet" type="text/css">

    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
    <script src="//oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
    <script src="//oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->

    <!-- Gallery -->
    <link href="//cdnjs.cloudflare.com/ajax/libs/featherlight/1.3.5/featherlight.min.css" type="text/css" rel="stylesheet" />

    <!-- Google Analytics -->
    


</head>


<body>

    <!-- Menu -->
    <!-- Navigation -->
<nav class="navbar navbar-default navbar-custom navbar-fixed-top">
    <div class="container-fluid">
        <!-- Brand and toggle get grouped for better mobile display -->
        <div class="navbar-header page-scroll">
            <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="/">Half Integer</a>
        </div>

        <!-- Collect the nav links, forms, and other content for toggling -->
        <div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
            <ul class="nav navbar-nav navbar-right">
                
                    <li>
                        <a href="https://Roger-luo.github.io/en/">
                            
                                English
                            
                        </a>
                    </li>
                
                    <li>
                        <a href="/">
                            
                                主页
                            
                        </a>
                    </li>
                
                    <li>
                        <a href="/cv">
                            
                                CV
                            
                        </a>
                    </li>
                
                    <li>
                        <a href="/codes">
                            
                                代码
                            
                        </a>
                    </li>
                
                    <li>
                        <a href="https://Roger-luo.github.io/slides/">
                            
                                幻灯片
                            
                        </a>
                    </li>
                
                    <li>
                        <a href="/archives">
                            
                                文档
                            
                        </a>
                    </li>
                
                    <li>
                        <a href="https://github.com/Roger-luo/Roger-luo.github.io">
                            
                                <i class="fa fa-github fa-stack-2x"></i>
                            
                        </a>
                    </li>
                
            </ul>
        </div>
        <!-- /.navbar-collapse -->
    </div>
    <!-- /.container -->
</nav>

    <!-- Main Content -->
    <!-- Page Header -->
<!-- Set your background image for this header in your post front-matter: cover -->

<header class="post-header" style="background-image: url('/img/home-bg-2.jpg')">
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <div class="post-heading">
                    <h1>为什么要制造量子计算机</h1>
                    
                    <span class="meta">
                        <!-- Date and Author -->
                        
                        2016-10-30
                    </span>
                </div>
            </div>
        </div>
    </div>
</header>

<!-- Post Content -->
<article>
    <div class="container">
        <div class="row">

            <!-- Tags and categories -->
           
                <div class="col-lg-4 col-lg-offset-2 col-md-5 col-md-offset-1 post-tags">
                    
                        


<a href="/tags/科普/">#科普</a>


                    
                </div>
                <div class="col-lg-4 col-md-5 post-categories">
                    
                </div>
            

            <!-- Gallery -->
            

            <!-- Post Main Content -->
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <p>&#x77E5;&#x4E4E;&#x4E13;&#x680F;&#x94FE;&#x63A5;:<a href="https://zhuanlan.zhihu.com/p/22962556?refer=quantum-computing" target="_blank" rel="external">&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x672D;&#x8BB0;|&#x524D;&#x8A00;</a></p>
<p><strong>&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x9020;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#xFF1F;</strong>&#x5728;&#x73B0;&#x4EE3;&#x7269;&#x7406;&#x548C;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x7684;&#x53D1;&#x5C55;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x6E10;&#x6E10;&#x5F00;&#x59CB;&#x9762;&#x4E34;&#x66F4;&#x52A0;&#x5E9E;&#x5927;&#x7684;&#x6570;&#x636E;&#x548C;&#x66F4;&#x52A0;&#x53EF;&#x6015;&#x7684;&#x8BA1;&#x7B97;&#x91CF;&#xFF0C;&#x800C;&#x6709;&#x4E9B;&#x95EE;&#x9898;&#x6211;&#x4EEC;&#x5728;&#x505A;&#x4E86;&#x4E00;&#x4E9B;&#x5C1D;&#x8BD5;&#x4E4B;&#x540E;&#x53D1;&#x73B0;&#xFF0C;&#x5982;&#x679C;&#x53EA;&#x6709;&#x6709;&#x9650;&#x7684;&#x7535;&#x5B50;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#xFF08;&#x7279;&#x6307;&#x7ECF;&#x5178;&#x7684;&#x7535;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#xFF09;&#x662F;&#x6839;&#x672C;&#x65E0;&#x6CD5;&#x5B8C;&#x6210;&#x5BF9;&#x5B83;&#x4EEC;&#x7684;&#x6C42;&#x89E3;&#x7684;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5728;&#x51DD;&#x805A;&#x6001;&#x7269;&#x7406;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5E38;&#x5E38;&#x9700;&#x8981;<strong>&#x6C42;&#x89E3;&#x591A;&#x4F53;&#x7684;&#x859B;&#x5B9A;&#x8C14;&#x65B9;&#x7A0B;</strong>&#xFF0C;&#x76F4;&#x63A5;&#x6C42;&#x89E3;&#x859B;&#x5B9A;&#x8C14;&#x65B9;&#x7A0B;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x5728;&#x5BF9;&#x4E00;&#x4E9B;&#x5F88;&#x5E9E;&#x5927;&#x7684;&#x77E9;&#x9635;&#x8FDB;&#x884C;&#x7EBF;&#x6027;&#x4EE3;&#x6570;&#x7684;&#x8BA1;&#x7B97;&#xFF0C;&#x518D;&#x5177;&#x4F53;&#x4E00;&#x4E9B;&#xFF0C;&#x5728;&#x6C42;&#x89E3;&#x4E00;&#x4E2A;n&#x4F53;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6570;&#x503C;&#x6C42;&#x89E3;&#x7684;&#x77E9;&#x9635;&#x5927;&#x7EA6;&#x6709;<span class="math inline">\(2\^n\times 2\^n\)</span>&#x8FD9;&#x4E48;&#x5927;&#x3002;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x57FA;&#x4E8E;&#x8FC5;&#x901F;&#x53D1;&#x5C55;&#x7684;&#x7535;&#x5B50;&#x5DE5;&#x4E1A;&#xFF0C;&#x6211;&#x4EEC;&#x5EFA;&#x9020;&#x4E86;&#x8D8A;&#x6765;&#x8D8A;&#x5F3A;&#x5927;&#x7684;&#x8D85;&#x7EA7;&#x8BA1;&#x7B97;&#x673A;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x8FD1;&#x671F;&#x5728;&#x4E16;&#x754C;&#x6700;&#x5FEB;&#x7684;&#x8D85;&#x7EA7;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;<strong>&#x6574;&#x673A;</strong>&#xFF08;800&#x4E07;&#x6838;&#xFF09;&#x8BA1;&#x7B97;&#x4E86;<a href="http:://www.nsccwx.cn/casedetail.php%3Fword%3Dcase%26i%3D58%26id%3D110" target="_blank" rel="external">&#x949B;&#x5408;&#x91D1;&#x5FAE;&#x7ED3;&#x6784;&#x6F14;&#x5316;&#x76F8;&#x573A;</a>&#x3002;&#x6216;&#x8005;&#x6211;&#x4EEC;&#x5C1D;&#x8BD5;&#x53BB;&#x4ECE;&#x8FD9;&#x4E48;&#x5927;&#x7684;&#x77E9;&#x9635;&#x4E2D;&#x63D0;&#x53D6;&#x4E00;&#x4E9B;&#x91CD;&#x8981;&#x7684;&#x90E8;&#x5206;&#x6765;&#x8BA1;&#x7B97;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x91CD;&#x6574;&#x5316;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x8BA1;&#x7B97;&#x4E00;&#x7EF4;&#x7684;Ising&#x6A21;&#x578B;&#xFF08;<a href="http:://baike.baidu.com/view/4637072.htm" target="_blank" rel="external">DMRG</a>&#xFF09;&#x3002;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x90FD;&#x6709;&#x5F88;&#x5927;&#x7684;&#x5C40;&#x9650;&#x6027;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x4E9B;&#x8DEF;&#x4E0A;&#x9047;&#x5230;&#x4E86;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x56F0;&#x96BE;&#x3002;</p>
<p>&#x540C;&#x65F6;&#x5728;&#x6700;&#x8FD1;&#xFF0C;&#x6211;&#x4EEC;&#x8FCE;&#x6765;&#x4E86;&#x4E00;&#x4E2A;&#x5927;&#x6570;&#x636E;&#xFF0C;&#x5927;&#x8BA1;&#x7B97;&#x7684;&#x65F6;&#x4EE3;&#xFF0C;&#x5BF9;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#x7684;&#x9700;&#x6C42;&#x4E5F;&#x8BB8;&#x6709;&#x4E00;&#x5929;&#x4F1A;&#x8D85;&#x8FC7;&#x7ECF;&#x5178;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x6216;&#x8005;&#x4F7F;&#x5F97;&#x7ECF;&#x5178;&#x8BA1;&#x7B97;&#x7684;&#x6210;&#x672C;&#x76F8;&#x5BF9;&#x66F4;&#x9AD8;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x6709;&#x4E00;&#x79CD;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;<strong>&#x80FD;&#x8017;&#x66F4;&#x4F4E;&#xFF0C;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x66F4;&#x5F3A;&#xFF0C;&#x5360;&#x7528;&#x7684;&#x7A7A;&#x95F4;&#x66F4;&#x5C0F;</strong>&#x3002;&#x5BF9;&#x4E8E;&#x80FD;&#x8017;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4ECE;&#x4E0A;&#x4E2A;&#x4E16;&#x7EAA;&#x5F00;&#x59CB;&#xFF0C;&#x5C31;&#x6709;&#x5173;&#x4E8E;&#x53EF;&#x9006;&#x8BA1;&#x7B97;&#x7684;&#x7814;&#x7A76;&#x4E86;&#x3002;&#x4EC0;&#x4E48;&#x662F;&#x53EF;&#x9006;&#x8BA1;&#x7B97;&#x5462;&#xFF1F;&#x53EF;&#x9006;&#x8BA1;&#x7B97;&#x5C31;&#x662F;&#x8BF4;&#x8FD9;&#x4E2A;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#x6240;&#x83B7;&#x5F97;&#x7684;&#x7ED3;&#x679C;&#x53EF;&#x4EE5;&#x4ECE;&#x8FD9;&#x4E2A;&#x7EBF;&#x8DEF;&#x8F93;&#x5165;&#x56DE;&#x53BB;&#x5F97;&#x5230;&#x4F60;&#x8F93;&#x5165;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x5728;&#x7269;&#x7406;&#x4E2D;&#x8868;&#x73B0;&#x4E3A;&#x6CA1;&#x6709;&#x71B5;&#x589E;&#x52A0;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x71B5;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x7EDD;&#x70ED;&#x8FC7;&#x7A0B;&#xFF0C;&#x662F;&#x4E0D;&#x8017;&#x80FD;&#x7684;&#x3002;&#x5176;&#x4E2D;Toffli&#x95E8;&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x80FD;&#x591F;&#x5B9E;&#x73B0;&#x53EF;&#x9006;&#x8BA1;&#x7B97;&#x7684;&#x95E8;&#x3002;</p>
<ul>
<li>&#x4E00;&#x4E2A;Toffli&#x95E8;</li>
</ul>
<div class="figure">
<img src="/images/toffli.jpg" alt="toffli gate">
<p class="caption">toffli gate</p>
</div>
<p>&#x800C;&#x6070;&#x597D;&#x901A;&#x7528;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x662F;&#x53EF;&#x9006;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x91CF;&#x5B50;&#x6BD4;&#x7279;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x538B;&#x7F29;&#x4FE1;&#x606F;&#xFF0C;&#x8868;&#x793A;&#x4E00;&#x4E2A;<span class="math inline">\(2\^n\)</span>&#x7684;&#x5411;&#x91CF;&#x53EA;&#x8981;<span class="math inline">\(n\)</span>&#x4E2A;qubit&#xFF08;&#x91CF;&#x5B50;&#x6BD4;&#x7279;&#xFF09;&#x5C31;&#x8DB3;&#x591F;&#x4E86;&#xFF0C;&#x7B80;&#x76F4;&#x662F;&#x5904;&#x7406;&#x5927;&#x6570;&#x636E;&#x7684;&#x5229;&#x5668;&#xFF01;</p>
<p>&#x6700;&#x8FD1;&#x51E0;&#x5E74;&#xFF0C;&#x5DE5;&#x4E1A;&#x754C;&#x7684;&#x4E00;&#x4E9B;&#x5927;&#x516C;&#x53F8;&#x9010;&#x6E10;&#x5F00;&#x59CB;&#x5173;&#x6CE8;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#xFF0C;&#x8C37;&#x6B4C;&#x516C;&#x53F8;&#x6536;&#x8D2D;&#x4E86;Dwave&#xFF08;<a href="http://36kr.com/p/172277.html" target="_blank" rel="external">&#x6DF1;&#x6CE2;</a>&#xFF09;&#xFF0C;&#x7528;&#x4EE5;&#x5F00;&#x53D1;&#x66F4;&#x5F3A;&#x5927;&#x7684;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x6765;&#x63D0;&#x9AD8;&#x5904;&#x7406;&#x5927;&#x6570;&#x636E;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x548C;&#x4E2D;&#x79D1;&#x9662;&#x5408;&#x4F5C;&#x6210;&#x7ACB;&#x4E86;<a href="http://scitech.people.com.cn/n/2015/0731/c1057-27388600.html" target="_blank" rel="external">&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x5B9E;&#x9A8C;&#x5BA4;</a>&#x3002;&#x5F53;&#x7136;<a href="http://stationq.com/" target="_blank" rel="external">&#x5DE8;&#x786C;</a>&#x7684;&#x7406;&#x8BBA;&#x7814;&#x7A76;&#x5F88;&#x65E9;&#x5C31;&#x5F00;&#x59CB;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x8FDB;&#x4E00;&#x6B65;&#x63A2;&#x7D22;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x5728;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x9886;&#x57DF;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x5C3D;&#x7BA1;&#x6211;&#x4EEC;&#x8FD8;&#x6CA1;&#x6709;&#x53D1;&#x73B0;&#x7279;&#x522B;&#x9707;&#x64BC;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x4E9B;&#x57FA;&#x4E8E;<a href="https://arxiv.org/pdf/0811.3171v3.pdf" target="_blank" rel="external">HHL&#x7B97;&#x6CD5;</a>&#xFF08;&#x4E00;&#x79CD;&#x6C42;&#x89E3;&#x7EBF;&#x6027;&#x65B9;&#x7A0B;&#x7EC4;&#x7684;&#x7B97;&#x6CD5;&#xFF09;&#x7684;&#x5DE5;&#x4F5C;&#x6BD4;&#x5982;<a href="https://arxiv.org/pdf/1307.0471v2.pdf" target="_blank" rel="external">QSVM</a>&#xFF08;&#x91CF;&#x5B50;&#x652F;&#x6301;&#x5411;&#x91CF;&#x673A;&#xFF09;&#x5DF2;&#x7ECF;&#x8868;&#x73B0;&#x51FA;&#x6307;&#x6570;&#x7EA7;&#x7684;&#x52A0;&#x901F;&#x6548;&#x679C;&#xFF0C;&#x5728;&#x6700;&#x8FD1;&#x7684;&#x91CF;&#x5B50;&#x73BB;&#x5C14;&#x5179;&#x66FC;&#x673A;&#x7684;&#x5DE5;&#x4F5C;&#x4E2D;&#x6211;&#x4EEC;&#x4E5F;&#x83B7;&#x5F97;&#x4E86;&#x76F8;&#x5BF9;&#x7ECF;&#x5178;&#x6A21;&#x578B;&#x66F4;&#x4F4E;&#x7684;KL&#x8DDD;&#x79BB;&#xFF08;KL divergence&#xFF09;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x6309;&#x7167;&#x859B;&#x5B9A;&#x8C14;&#x65B9;&#x7A0B;&#x8FDB;&#x884C;&#x6F14;&#x5316;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x6709;&#x53EF;&#x80FD;&#x66F4;&#x52A0;&#x7CBE;&#x786E;&#x5730;&#x6570;&#x503C;&#x6C42;&#x89E3;&#x591A;&#x4F53;&#x7CFB;&#x7EDF;&#x4E86;&#x3002;&#x53EA;&#x8981;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x91CF;&#x5B50;&#x6BD4;&#x7279;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x6784;&#x9020;&#x9700;&#x8981;&#x6C42;&#x89E3;&#x7684;&#x54C8;&#x5BC6;&#x987F;&#x91CF;&#x5F88;&#x66B4;&#x529B;&#x5730;&#x6C42;&#x89E3;&#x51FA;&#x8FD9;&#x4E2A;&#x91CF;&#x5B50;&#x7CFB;&#x7EDF;&#x7684;&#x7279;&#x5F81;&#x6765;&#x3002;&#x751A;&#x81F3;&#x5DF2;&#x7ECF;&#x51FA;&#x73B0;&#x4E86;&#x5F88;&#x591A;&#x7528;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x7684;&#x65B9;&#x5F0F;&#x6A21;&#x62DF;&#x5316;&#x5B66;&#x5206;&#x5B50;&#x7B49;&#x591A;&#x4F53;&#x7CFB;&#x7EDF;&#x7684;&#x5DE5;&#x4F5C;&#x4E86;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;<a href="https://arxiv.org/pdf/1007.2648.pdf" target="_blank" rel="external">&#x7528;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x6765;&#x6A21;&#x62DF;&#x5316;&#x5B66;&#x8FC7;&#x7A0B;</a>&#x3002;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x80FD;&#x591F;&#x53BB;&#x8BBE;&#x8BA1;&#xFF0C;&#x5BFB;&#x627E;&#x66F4;&#x597D;&#x7684;&#x6750;&#x6599;&#xFF0C;&#x836F;&#x7269;&#xFF0C;&#x4ECE;&#x800C;&#x6539;&#x5584;&#x8FD9;&#x4E2A;&#x793E;&#x4F1A;&#x7684;&#x65B9;&#x65B9;&#x9762;&#x9762;&#x3002;</p>
<p>&#x540C;&#x65F6;&#x201C;&#x90AA;&#x6076;&#x201D;&#x7684;&#x79D1;&#x5B66;&#x5BB6;&#x8FD8;&#x60F3;&#x7740;&#x7834;&#x89E3;&#x94F6;&#x884C;&#x5BC6;&#x7801;&#xFF08;<a href="http://blog.csdn.net/sunmenggmail/article/details/11994013" target="_blank" rel="external">RSA&#x5BC6;&#x94A5;</a>&#xFF09;&#x8FD9;&#x6837;&#x5C31;&#x80FD;&#x8FC7;&#x4E0A;&#x6BCF;&#x5929;&#x5403;&#x8089;&#x7684;&#x751F;&#x6D3B;&#x4E86;&#xFF01;</p>
<p>&#x66F4;&#x8FDB;&#x4E00;&#x6B65;&#xFF0C;&#x5236;&#x9020;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x5B9E;&#x9645;&#x4E0A;&#x4E5F;&#x662F;&#x5728;&#x5236;&#x9020;&#x4E00;&#x4E9B;&#x53EF;&#x4EE5;&#x8C03;&#x6574;&#x7684;&#x91CF;&#x5B50;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FD9;&#x4E5F;&#x8BB8;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x5236;&#x9020;&#x65B0;&#x7684;&#x7269;&#x8D28;&#x5F62;&#x6001;&#xFF0C;&#x53D1;&#x73B0;&#x65B0;&#x7684;&#x7269;&#x7406;&#xFF0C;&#x5728;&#x8D70;&#x5411;&#x5236;&#x9020;&#x901A;&#x7528;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x8DEF;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x53D1;&#x73B0;&#x66F4;&#x591A;&#x7684;&#x65B0;&#x7269;&#x7406;&#xFF0C;&#x65B0;&#x6570;&#x5B66;&#xFF0C;&#x65B0;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x2026;&#x2026;</p>
<p>&#x90A3;&#x4E48;&#x8BFB;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x5047;&#x5982;&#x6211;&#x5199;&#x7684;&#x8FD8;&#x7B97;&#x597D;&#xFF0C;&#x4F60;&#x5927;&#x6982;&#x4F1A;&#x95EE;&#x4EC0;&#x4E48;&#x662F;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#xFF0C;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#xFF1F;&#x5173;&#x4E8E;&#x8FD9;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4F60;&#x4F1A;&#x5728;&#x540E;&#x9762;&#x5F97;&#x5230;&#x7B54;&#x6848;&#x3002;</p>
<p>&#x53C2;&#x8003;&#x6587;&#x732E;</p>
<p>Harrow A W, Hassidim A, Lloyd S, et al. Quantum Algorithm for Linear Systems of Equations[J]. Physical Review Letters, 2009, 103(15).</p>
<p>Rebentrost P, Mohseni M, Lloyd S, et al. Quantum support vector machine for big data classification[J]. Physical Review Letters, 2013, 113(13).</p>
<p>Amin, M H S and Andriyash, Evgeny and Rolfe, Jason and Kulchytskyy, Bohdan and Melko, Roger G. Arxiv:1601.02036</p>
<p>Kassal, I., Whitfield, J. D., Perdomoortiz, A., Yung, M., &amp; Aspuruguzik, A. (2011). Simulating chemistry using quantum computers.. Annual Review of Physical Chemistry,, 185-207.</p>


                
            </div>

            <!-- Comments -->
            
                <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                    


  <section id="comments">
    <!-- 多说评论框 start -->
    <div class="ds-thread" data-thread-key="post-为什么要制造量子计算机" data-title="为什么要制造量子计算机" data-url="http://Roger-luo.github.com/2016/10/30/为什么要制造量子计算机/"></div>
    <!-- 多说评论框 end -->
    <!-- 多说公共JS代码 start (一个网页只需插入一次) -->
    <script type="text/javascript">
    var duoshuoQuery = {short_name:'rogerluo'};
      (function() {
        var ds = document.createElement('script');
        ds.type = 'text/javascript';ds.async = true;
        ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
        ds.charset = 'UTF-8';
        (document.getElementsByTagName('head')[0] 
         || document.getElementsByTagName('body')[0]).appendChild(ds);
        })();
            </script>
        <!-- 多说公共JS代码 end -->
    </section>

                </div>
            
        </div>
    </div>
</article>


    <!-- Footer -->
    <hr />

<!-- Footer -->
<footer>
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <ul class="list-inline text-center">
                    

                    

                    
                        <li>
                            <a href="https://github.com/Roger-luo" target="_blank">
                                <span class="fa-stack fa-lg">
                                    <i class="fa fa-circle fa-stack-2x"></i>
                                    <i class="fa fa-github fa-stack-1x fa-inverse"></i>
                                </span>
                            </a>
                        </li>
                    

                    
                        <li>
                            <a onclick="alert('Email me to get my wechat XD ')" target="_blank">
                                <span class="fa-stack fa-lg">
                                    <i class="fa fa-circle fa-stack-2x"></i>
                                    <i class="fa fa-wechat fa-stack-1x fa-inverse"></i>
                                </span>
                            </a>
                        </li>
                    

                    

                    
                        <li>
                            <a href="mailto:hiroger@qq.com" target="_blank">
                                <span class="fa-stack fa-lg">
                                    <i class="fa fa-circle fa-stack-2x"></i>
                                    <i class="fa fa-envelope-o fa-stack-1x fa-inverse"></i>
                                </span>
                            </a>
                        </li>
                    

                    
                </ul>
                
                <div class="copyright text-muted">
                    <div class="panel-heading">
                        <h4 class="panel-title">
                            <a data-toggle="collapse" data-parent="#accordion" href="#collapseOne">
                                Click to see Roger Luo's friends :-)
                            </a>
                        </h4>
                    </div>
                <div id="collapseOne" class="panel-collapse collapse">
                
                <p class="copyright text-muted" style="margin-top: 7px">
                <a target="_blank" href="http://crduan.cc">Chenru Duan</a>
                </p>
                
                <p class="copyright text-muted" style="margin-top: 7px">
                <a target="_blank" href="http://chenjunwang.com">Chenjun Wang</a>
                </p>
                
                </div>
                </div>

                
            </div>
        </div>
    </div>
</footer>


    <!-- After footer scripts -->
    
<!-- jQuery -->
<script src="//code.jquery.com/jquery-2.1.4.min.js"></script>

<!-- Bootstrap -->
<script src="//maxcdn.bootstrapcdn.com/bootstrap/3.3.6/js/bootstrap.min.js"></script>

<!-- Gallery -->
<script src="//cdnjs.cloudflare.com/ajax/libs/featherlight/1.3.5/featherlight.min.js" type="text/javascript" charset="utf-8"></script>

<!-- Waypoint -->
<script src="//cdnjs.cloudflare.com/ajax/libs/waypoints/4.0.1/noframework.waypoints.min.js" type="text/javascript" charset="utf-8"></script>

<!-- Disqus Comments -->
<!-- 
<script type="text/javascript">
    var disqus_shortname = 'rogerluo';

    (function(){
        var dsq = document.createElement('script');
        dsq.type = 'text/javascript';
        dsq.async = true;
        dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
        (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    }());
</script>
 -->

<!-- MathJax -->
<script type="text/x-mathjax-config">
    MathJax.Hub.Config({
        tex2jax: {
          inlineMath: [ ['$','$'], ["\\(","\\)"] ],
          displayMath: [ ['$$', '$$'], ["\\[", "\\]"] ],
          processEscapes: true
        },
        TeX: {
          equationNumbers: {
            autoNumber: 'AMS'
          }
        },
        "HTML-CSS": {
          imageFont: null
        }
      });
</script>

<script type="text/javascript" src="http://cdn.mathjax.org/mathjax/2.1-latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>

<div id="totop" style="position:fixed;bottom:20px;right:50px;cursor: pointer;">
    <span class="fa-stack fa-lg">
        <i class="fa fa-arrow-circle-up fa-stack-2x"></i>
    </span>
</div>


<script src="/js/totop.js"></script>


</body>

</html>