<!DOCTYPE html>
<html lang="en">

<!-- Head tag -->
<head>

    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">

    <!--Description-->
    
        <meta name="description" content="Not every post is provided with an English version (eg. novels)">
    

    <!--Author-->
    
        <meta name="author" content="Roger Luo">
    

    <!--Open Graph Title-->
    
        <meta property="og:title" content="novel|Chapter II"/>
    

    <!--Open Graph Description-->
    
        <meta property="og:description" content="Not every post is provided with an English version (eg. novels)" />
    

    <!--Open Graph Site Name-->
    <meta property="og:site_name" content="Half Integer"/>

    <!--Type page-->
    
        <meta property="og:type" content="article" />
    

    <!--Page Cover-->
    

        <meta name="twitter:card" content="summary" />
    

    <!-- Title -->
    
    <title>novel|Chapter II - Half Integer</title>

    <!-- Bootstrap Core CSS -->
    <link href="//maxcdn.bootstrapcdn.com/bootstrap/3.3.6/css/bootstrap.min.css" rel="stylesheet"/>

    <!-- Custom CSS -->
    <link rel="stylesheet" href="/css/style.css">

    <!-- Custom Fonts -->
    <link href="//maxcdn.bootstrapcdn.com/font-awesome/4.6.3/css/font-awesome.min.css" rel="stylesheet" type="text/css">
    <link href="//fonts.googleapis.com/css?family=Lora:400,700,400italic,700italic" rel="stylesheet" type="text/css">
    <link href="//fonts.googleapis.com/css?family=Open+Sans:300italic,400italic,600italic,700italic,800italic,400,300,600,700,800" rel="stylesheet" type="text/css">

    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
    <script src="//oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
    <script src="//oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->

    <!-- Gallery -->
    <link href="//cdnjs.cloudflare.com/ajax/libs/featherlight/1.3.5/featherlight.min.css" type="text/css" rel="stylesheet" />

    <!-- Google Analytics -->
    


</head>


<body>

    <!-- Menu -->
    <!-- Navigation -->
<nav class="navbar navbar-default navbar-custom navbar-fixed-top">
    <div class="container-fluid">
        <!-- Brand and toggle get grouped for better mobile display -->
        <div class="navbar-header page-scroll">
            <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="/">Half Integer</a>
        </div>

        <!-- Collect the nav links, forms, and other content for toggling -->
        <div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
            <ul class="nav navbar-nav navbar-right">
                
                    <li>
                        <a href="https://Roger-luo.github.io/en/">
                            
                                English
                            
                        </a>
                    </li>
                
                    <li>
                        <a href="/">
                            
                                主页
                            
                        </a>
                    </li>
                
                    <li>
                        <a href="/cv">
                            
                                CV
                            
                        </a>
                    </li>
                
                    <li>
                        <a href="/codes">
                            
                                代码
                            
                        </a>
                    </li>
                
                    <li>
                        <a href="https://Roger-luo.github.io/slides/">
                            
                                幻灯片
                            
                        </a>
                    </li>
                
                    <li>
                        <a href="/archives">
                            
                                文档
                            
                        </a>
                    </li>
                
                    <li>
                        <a href="https://github.com/Roger-luo/Roger-luo.github.io">
                            
                                <i class="fa fa-github fa-stack-2x"></i>
                            
                        </a>
                    </li>
                
            </ul>
        </div>
        <!-- /.navbar-collapse -->
    </div>
    <!-- /.container -->
</nav>

    <!-- Main Content -->
    <!-- Page Header -->
<!-- Set your background image for this header in your post front-matter: cover -->

<header class="post-header" style="background-image: url('/img/home-bg-2.jpg')">
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <div class="post-heading">
                    <h1>novel|Chapter II</h1>
                    
                    <span class="meta">
                        <!-- Date and Author -->
                        
                        2016-01-08
                    </span>
                </div>
            </div>
        </div>
    </div>
</header>

<!-- Post Content -->
<article>
    <div class="container">
        <div class="row">

            <!-- Tags and categories -->
           
                <div class="col-lg-4 col-lg-offset-2 col-md-5 col-md-offset-1 post-tags">
                    
                        


<a href="/tags/novel/">#novel</a>


                    
                </div>
                <div class="col-lg-4 col-md-5 post-categories">
                    
                </div>
            

            <!-- Gallery -->
            

            <!-- Post Main Content -->
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <h2 id="luo-heng">&#x7F57;&#x8861; <a href="#luo-heng" class="header-anchor">#</a></h2>
<p>&#x7F57;&#x8861;&#x662F;&#x57CE;&#x4E3B;&#x7684;&#x5C0F;&#x513F;&#x5B50;&#xFF0C;&#x624D;&#x8FC7;10&#x5C81;&#xFF0C;&#x4F36;&#x4FD0;&#x53EF;&#x7231;&#xFF0C;&#x6DF1;&#x5F97;&#x57CE;&#x4E3B;&#x559C;&#x7231;&#xFF0C;&#x53EF;&#x60DC;&#x4F53;&#x5F31;&#x591A;&#x75C5;&#xFF0C;&#x4E8E;&#x662F;&#x5BB6;&#x91CC;&#x4FBF;&#x603B;&#x60F3;&#x7740;&#x4ED6;&#x80FD;&#x50CF;&#x4ED6;&#x54E5;&#x54E5;&#x4E00;&#x6837;&#x4E60;&#x6B66;&#xFF0C;&#x5F3A;&#x8EAB;&#x5065;&#x4F53;&#x3002;&#x4ECA;&#x5929;&#x53C8;&#x8BE5;&#x548C;&#x4ED6;&#x7684;&#x5144;&#x957F;&#x7F57;&#x6C49;&#x4E00;&#x8D77;&#x7EC3;&#x4E60;&#x5251;&#x672F;&#x4E86;&#x3002;&#x4ED6;&#x7684;&#x5144;&#x957F;&#x7F57;&#x6C49;&#x5DF2;&#x7ECF;18&#x4E86;&#xFF0C;&#x5C31;&#x50CF;&#x4ED6;&#x7684;&#x540D;&#x5B57;&#x7ED9;&#x4EBA;&#x7684;&#x611F;&#x89C9;&#x4E00;&#x6837;&#xFF0C;&#x8EAB;&#x5F3A;&#x529B;&#x58EE;&#xFF0C;&#x81EA;&#x5E7C;&#x559C;&#x6B22;&#x4E60;&#x6B66;&#xFF0C;&#x53EF;&#x662F;&#x5374;&#x4E0D;&#x7231;&#x8BFB;&#x4E66;&#xFF0C;&#x57CE;&#x4E3B;&#x603B;&#x6015;&#x4ED6;&#x6700;&#x7EC8;&#x6210;&#x4E3A;&#x4E86;&#x4E00;&#x4E2A;&#x803F;&#x76F4;&#x7684;&#x83BD;&#x6C49;&#xFF0C;&#x4E3A;&#x4ED6;&#x8BF7;&#x4E86;&#x4E0D;&#x5C11;&#x8001;&#x5E08;&#xFF0C;&#x82B1;&#x4E86;&#x4E0D;&#x5C11;&#x7684;&#x94B1;&#xFF0C;&#x4F46;&#x662F;&#x7F57;&#x6C49;&#x4ED7;&#x7740;&#x81EA;&#x5DF1;&#x662F;&#x57CE;&#x4E3B;&#x4E4B;&#x5B50;&#xFF0C;&#x5C0F;&#x65F6;&#x5019;&#x5F88;&#x662F;&#x8C03;&#x76AE;&#xFF0C;&#x628A;&#x8BF7;&#x6765;&#x7684;&#x8001;&#x5E08;&#x90FD;&#x6253;&#x8DD1;&#x4E86;&#x3002;&#x540E;&#x6765;&#x6709;&#x4E86;&#x5C0F;&#x513F;&#x5B50;&#xFF0C;&#x57CE;&#x4E3B;&#x7D22;&#x6027;&#x4E5F;&#x4E0D;&#x7BA1;&#x4ED6;&#xFF0C;&#x53CD;&#x6B63;&#x6210;&#x5E74;&#x4E86;&#x60F3;&#x505A;&#x4EC0;&#x4E48;&#x5C31;&#x505A;&#x4EC0;&#x4E48;&#x5427;&#x3002;</p>
<p>&#x7F57;&#x6A2A;&#x5E76;&#x4E0D;&#x559C;&#x6B22;&#x65E9;&#x8D77;&#xFF0C;&#x66F4;&#x4E0D;&#x559C;&#x6B22;&#x7EC3;&#x5251;&#xFF0C;&#x6BCF;&#x6B21;&#x7EC3;&#x5251;&#x56DE;&#x6765;&#xFF0C;&#x90FD;&#x4F1A;&#x89C9;&#x5F97;&#x6D51;&#x8EAB;&#x90FD;&#x75BC;&#x3002;&#x53EF;&#x662F;&#x4E00;&#x5927;&#x65E9;&#x8FD8;&#x662F;&#x88AB;&#x96C7;&#x6765;&#x7167;&#x987E;&#x4ED6;&#x7684;&#x738B;&#x5988;&#x4E03;&#x54C4;&#x516B;&#x54C4;&#x7684;&#xFF0C;&#x53BB;&#x4E86;&#x6B66;&#x9986;&#xFF0C;&#x6EE1;&#x8138;&#x7684;&#x4E0D;&#x60C5;&#x613F;&#x3002;&#x6B66;&#x9986;&#x5728;&#x5185;&#x57CE;&#x7684;&#x5317;&#x9762;&#xFF0C;&#x5185;&#x57CE;&#x548C;&#x57CE;&#x91CC;&#x90FD;&#x6709;&#x95E8;&#x53EF;&#x8D70;&#x3002;&#x8DEF;&#x4E0A;&#x7F57;&#x6A2A;&#x5FC3;&#x91CC;&#x5C31;&#x60F3;&#xFF0C;&#x4E00;&#x7FA4;&#x4EBA;&#x81ED;&#x54C4;&#x54C4;&#x7684;&#x6709;&#x4EC0;&#x4E48;&#x597D;&#x7EC3;&#x7684;&#xFF0C;&#x968F;&#x4FBF;&#x6765;&#x4E00;&#x95E8;&#x5927;&#x70AE;&#x4E0D;&#x8FD8;&#x662F;&#x6CA1;&#x7528;&#xFF0C;&#x8981;&#x662F;&#x78B0;&#x5230;&#x738B;&#x5976;&#x5976;&#x8BF4;&#x7684;&#x9B54;&#x6CD5;&#xFF0C;&#x90A3;&#x5C31;&#x66F4;&#x5E9F;&#x4E86;&#x3002;&#x4E00;&#x8FDB;&#x6B66;&#x9986;&#x5927;&#x95E8;&#xFF0C;&#x6251;&#x9F3B;&#x800C;&#x6765;&#x7684;&#x5C31;&#x662F;&#x90A3;&#x79CD;&#x6C57;&#x6D25;&#x6D25;&#x7684;&#x5473;&#x9053;&#xFF0C;&#x6B66;&#x9986;&#x662F;&#x519B;&#x961F;&#x5F00;&#x7684;&#xFF0C;&#x73B0;&#x5728;&#x8D6B;&#x77F3;&#x57CE;&#x4E5F;&#x65E0;&#x5916;&#x60A3;&#xFF0C;&#x7ECF;&#x6D4E;&#x7E41;&#x8363;&#xFF0C;&#x60F3;&#x6210;&#x4E3A;&#x519B;&#x5B98;&#x62FF;&#x94C1;&#x996D;&#x7897;&#x7684;&#x4EBA;&#x603B;&#x662F;&#x5F88;&#x591A;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EBA;&#x90FD;&#x5F88;&#x52E4;&#x594B;&#x3002;&#x548C;&#x4ED6;&#x4EEC;&#x7EC3;&#x5251;&#xFF0C;&#x53EA;&#x4F1A;&#x66F4;&#x7D2F;&#x3002;</p>
<p>&#x7F57;&#x6A2A;&#x5FC3;&#x91CC;&#x76D8;&#x7B97;&#x597D;&#x4E86;&#xFF0C;&#x4ECA;&#x5929;&#x5C31;&#x88C5;&#x75C5;&#x5427;&#xFF0C;&#x968F;&#x4FBF;&#x6446;&#x6446;&#x6837;&#x5B50;&#x5C31;&#x597D;&#x3002;&#x5FFD;&#x7136;&#x6709;&#x4EBA;&#x5728;&#x80CC;&#x540E;&#x53EB;&#x4ED6;&#x3002;</p>
<p>&#x201C;&#x7F57;&#x6A2A;&#xFF01;&#x63A5;&#x5251;&#xFF01;&#x201D;&#x662F;&#x7F57;&#x6C49;&#x7684;&#x58F0;&#x97F3;&#xFF0C;&#x968F;&#x624B;&#x6254;&#x7ED9;&#x4ED6;&#x4E00;&#x628A;&#x6728;&#x5251;&#xFF0C;&#x4EE5;&#x7F57;&#x6A2A;&#x7684;&#x5251;&#x672F;&#xFF0C;&#x8FD8;&#x6CA1;&#x5230;&#x7528;&#x771F;&#x5251;&#x7684;&#x65F6;&#x5019;&#x3002;</p>
<p>&#x7F57;&#x6A2A;&#x6697;&#x53EB;&#x4E0D;&#x597D;&#xFF0C;&#x770B;&#x6765;&#x4ECA;&#x5929;&#x8981;&#x548C;&#x7F57;&#x6C49;&#x7EC3;&#x4E86;&#x3002;&#x7F57;&#x6C49;&#x7684;&#x5251;&#x672F;&#x5DF2;&#x7ECF;&#x5728;&#x897F;&#x5317;&#x90FD;&#x5C0F;&#x6709;&#x540D;&#x6C14;&#x4E86;&#xFF0C;&#x4E0D;&#x4EC5;&#x6709;&#x86EE;&#x529B;&#xFF0C;&#x66F4;&#x6709;&#x6280;&#x5DE7;&#x3002;&#x5BF9;&#x5F85;&#x8FD9;&#x4E2A;&#x5F1F;&#x5F1F;&#x53C8;&#x662F;&#x767E;&#x822C;&#x5475;&#x62A4;&#xFF0C;&#x540C;&#x6837;&#x4E5F;&#x5F88;&#x5E0C;&#x671B;&#x901A;&#x8FC7;&#x7EC3;&#x4E60;&#x5251;&#x672F;&#x8BA9;&#x7F57;&#x6A2A;&#x6709;&#x4E2A;&#x597D;&#x8EAB;&#x4F53;&#xFF0C;&#x800C;&#x4E14;&#x4F1A;&#x5251;&#x672F;&#x7684;&#x8BDD;&#xFF0C;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x51FA;&#x4E86;&#x57CE;&#x4E5F;&#x80FD;&#x8BA9;&#x4EBA;&#x653E;&#x5FC3;&#x4E00;&#x4E9B;&#x3002;</p>
<p>&#x7F57;&#x6A2A;&#x6CA1;&#x6709;&#x63A5;&#x5230;&#x5251;&#xFF0C;&#x5251;&#x843D;&#x5728;&#x4ED6;&#x811A;&#x4E0B;&#xFF0C;&#x4ED6;&#x4F38;&#x624B;&#x6361;&#x8D77;&#xFF0C;&#x53F3;&#x811A;&#x5411;&#x524D;&#x8FC8;&#x51FA;&#x534A;&#x6B65;&#xFF0C;&#x5DE6;&#x624B;&#x80CC;&#x5728;&#x540E;&#x9762;&#xFF0C;&#x6446;&#x51FA;&#x4E00;&#x4E2A;&#x5BF9;&#x6218;&#x7684;&#x67B6;&#x5B50;&#x3002;&#x7F57;&#x6C49;&#x4E00;&#x7B11;&#xFF0C;&#x4E5F;&#x7528;&#x4E00;&#x628A;&#x6728;&#x5251;&#xFF0C;&#x653B;&#x4E86;&#x8FC7;&#x6765;&#x3002;</p>
<p>&#x201C;&#x770B;&#x597D;&#x4E86;&#xFF01;&#x201D;</p>
<p>&#x7F57;&#x6A2A;&#x8FD8;&#x662F;&#x6446;&#x7740;&#x4E00;&#x5F20;&#x6CA1;&#x7761;&#x9192;&#x7684;&#x8138;&#x3002;</p>
<p>&#x2026;&#x2026;</p>
<p>&#x4E0D;&#x8FC7;&#x4ECA;&#x5929;&#x7F57;&#x6A2A;&#x8FD0;&#x6C14;&#x597D;&#x3002;&#x4ED6;&#x6BCD;&#x4EB2;&#x9676;&#x73B2;&#x6765;&#x5E26;&#x7F57;&#x6A2A;&#x53BB;&#x57CE;&#x91CC;&#x8F6C;&#x4E86;&#x3002;</p>
<p>&#x201C;&#x5C0F;&#x77F3;&#x5934;&#xFF5E;&#x201D;&#x542C;&#x5230;&#x6BCD;&#x4EB2;&#x53EB;&#x4ED6;&#x7684;&#x5C0F;&#x540D;&#xFF0C;&#x7F57;&#x6A2A;&#x7ACB;&#x523B;&#x7CBE;&#x795E;&#x4E86;&#xFF0C;&#x4ED6;&#x77E5;&#x9053;&#x4ECA;&#x5929;&#x4E0D;&#x7528;&#x7EC3;&#x5251;&#x4E86;&#xFF0C;&#x8DD1;&#x53BB;&#x62C9;&#x8D77;&#x4ED6;&#x6BCD;&#x4EB2;&#x7684;&#x624B;&#x3002;</p>
<p>&#x201C;&#x7F57;&#x6C49;&#x554A;&#xFF0C;&#x4F60;&#x5440;&#x5C11;&#x7EC3;&#x70B9;&#xFF0C;&#x4F60;&#x770B;&#x770B;&#x4E00;&#x5927;&#x65E9;&#x7684;&#x5C31;&#x4E00;&#x8EAB;&#x6C57;&#x7684;&#xFF0C;&#x591A;&#x8BFB;&#x8BFB;&#x4E66;&#xFF0C;&#x522B;&#x4E00;&#x5929;&#x603B;&#x548C;&#x519B;&#x91CC;&#x7684;&#x7537;&#x4EBA;&#x6DF7;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x4E0D;&#x7136;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x624D;&#x80FD;&#x627E;&#x5230;&#x5AB3;&#x5987;&#x554A;&#xFF1F;&#x6211;&#x5E26;&#x4F60;&#x5F1F;&#x5F1F;&#x53BB;&#x56FE;&#x4E66;&#x9986;&#x627E;&#x5927;&#x5B66;&#x58EB;&#x770B;&#x770B;&#x201D;</p>
<p>&#x201C;&#x54E6;&#xFF0C;&#x77E5;&#x9053;&#x4E86;&#x201D;&#xFF0C;&#x7F57;&#x6C49;&#x50CF;&#x5F80;&#x5E38;&#x4E00;&#x6837;&#x56DE;&#x7B54;&#x9053;&#xFF0C;&#x6BCD;&#x4EB2;&#x5982;&#x6B64;&#x7684;&#x5520;&#x53E8;&#xFF0C;&#x4ED6;&#x65E9;&#x5DF2;&#x4E60;&#x60EF;&#x3002;</p>
<p>&#x9676;&#x73B2;&#x89C1;&#x7F57;&#x6C49;&#x8FD8;&#x662F;&#x4E00;&#x526F;&#x65E0;&#x6240;&#x8C13;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x4E5F;&#x6CA1;&#x518D;&#x591A;&#x8BF4;&#xFF0C;&#x62C9;&#x8D77;&#x7F57;&#x6A2A;&#x53BB;&#x5750;&#x9A6C;&#x8F66;&#x3002;</p>
<p>&#x201C;&#x884C;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x8D70;&#x4E86;&#x201D;</p>
<p>&#x201C;&#x54CE;&#x201D;</p>
<p>&#x201C;&#x5988;&#xFF0C;&#x6211;&#x4EEC;&#x53BB;&#x627E;&#x5927;&#x5B66;&#x58EB;&#x5E72;&#x561B;&#x53BB;&#x554A;&#xFF1F;&#x201D;</p>
<p>&#x201C;&#x6211;&#x770B;&#x4F60;&#x5440;&#x4E5F;&#x4E0D;&#x60F3;&#x7EC3;&#x5251;&#xFF0C;&#x5E26;&#x4F60;&#x89C1;&#x89C1;&#x5927;&#x5B66;&#x58EB;&#xFF0C;&#x8981;&#x662F;&#x5927;&#x5B66;&#x662F;&#x613F;&#x610F;&#x6559;&#x4F60;&#xFF0C;&#x4F60;&#x5C31;&#x53BB;&#x548C;&#x5927;&#x5B66;&#x58EB;&#x5B66;&#x5427;&#x201D;</p>
<p>&#x201C;&#x54E6;&#x201D;&#xFF0C;&#x7F57;&#x6A2A;&#x8FD8;&#x6CA1;&#x6709;&#x53BB;&#x8FC7;&#x56FE;&#x4E66;&#x9986;&#xFF0C;&#x6EE1;&#x8138;&#x5174;&#x594B;&#x3002;</p>
<p>&#x9676;&#x73B2;&#x5E26;&#x7740;&#x5C0F;&#x77F3;&#x5934;&#x6765;&#x5230;&#x4E86;&#x56FE;&#x4E66;&#x9986;&#x3002;&#x8D6B;&#x77F3;&#x57CE;&#x7684;&#x56FE;&#x4E66;&#x9986;&#x662F;&#x5148;&#x7956;&#x7F57;&#x6853;&#x516C;&#x4EB2;&#x624B;&#x8BBE;&#x8BA1;&#xFF0C;&#x5728;&#x5916;&#x57CE;&#x5899;&#x7684;&#x897F;&#x5357;&#x9760;&#x91CC;&#xFF0C;&#x662F;&#x53E4;&#x9999;&#x53E4;&#x8272;&#x7684;&#x4E1C;&#x65B9;&#x5EFA;&#x7B51;&#xFF0C;&#x4E00;&#x5171;&#x6709;&#x4E94;&#x5C42;&#xFF0C;&#x5374;&#x53C8;&#x50CF;&#x662F;&#x77F3;&#x5934;&#x78CA;&#x8D77;&#x6765;&#x7684;&#x57CE;&#x5821;&#xFF0C;&#x6728;&#x8D28;&#x7684;&#x6846;&#x67B6;&#xFF0C;&#x77F3;&#x8D28;&#x7684;&#x5899;&#x58C1;&#x3002;&#x76F8;&#x4F20;&#x91CC;&#x9762;&#x6697;&#x85CF;&#x673A;&#x62EC;&#xFF0C;&#x5FC5;&#x8981;&#x65F6;&#x53EF;&#x4EE5;&#x5341;&#x540D;&#x52C7;&#x58EB;&#x62B5;&#x6321;&#x5343;&#x519B;&#x4E07;&#x9A6C;&#x5341;&#x65E5;&#x3002;&#x53EA;&#x662F;&#x5E74;&#x4EE3;&#x5DF2;&#x4E45;&#xFF0C;&#x8C01;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x5426;&#x771F;&#x7684;&#x5982;&#x6B64;&#xFF0C;&#x4E5F;&#x53EA;&#x5F53;&#x662F;&#x8D6B;&#x77F3;&#x7684;&#x4F20;&#x8BF4;&#x7F62;&#x4E86;&#x3002;</p>
<p>&#x5927;&#x5B66;&#x58EB;&#x662F;&#x57CE;&#x4E3B;&#x7684;&#x53D4;&#x53D4;&#xFF0C;&#x4E5F;&#x662F;&#x552F;&#x4E00;&#x6CA1;&#x6709;&#x53BB;&#x4E16;&#x7684;&#x6E90;&#x5B57;&#x8F88;&#xFF0C;&#x53EB;&#x7F57;&#x6E90;&#x758F;&#xFF0C;&#x5DF2;&#x7ECF;70&#x5C81;&#x4E86;&#xFF0C;&#x4E00;&#x5934;&#x957F;&#x957F;&#x989D;&#x767D;&#x53D1;&#xFF0C;&#x767D;&#x80E1;&#x5B50;&#xFF0C;&#x7A7F;&#x7740;&#x7070;&#x8272;&#x7684;&#x5B66;&#x58EB;&#x957F;&#x888D;&#x3002;&#x4ED6;&#x7EE7;&#x627F;&#x4E86;&#x4E00;&#x90E8;&#x5206;&#x5BB6;&#x4F20;&#x7684;&#x673A;&#x68B0;&#x8BBE;&#x8BA1;&#xFF0C;&#x8BF4;&#x662F;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x5F88;&#x591A;&#x8FC7;&#x53BB;&#x7684;&#x673A;&#x68B0;&#x7406;&#x8BBA;&#x90FD;&#x4E22;&#x5931;&#x4E86;&#x3002;&#x540C;&#x65F6;&#x65F6;&#x4EE3;&#x4E5F;&#x5728;&#x8FDB;&#x6B65;&#xFF0C;&#x4E0D;&#x65AD;&#x5730;&#x51FA;&#x73B0;&#x66F4;&#x597D;&#x7684;&#x673A;&#x62EC;&#xFF0C;&#x66F4;&#x7CBE;&#x5DE7;&#x7684;&#x673A;&#x68B0;&#x3002;&#x5927;&#x5B66;&#x58EB;&#x5C06;&#x6BD5;&#x751F;&#x7684;&#x65F6;&#x95F4;&#x90FD;&#x5949;&#x732E;&#x7ED9;&#x4E86;&#x77E5;&#x8BC6;&#xFF0C;&#x4ED6;&#x4E0A;&#x77E5;&#x5929;&#x6587;&#x4E0B;&#x77E5;&#x5730;&#x7406;&#xFF0C;&#x662F;&#x8D6B;&#x77F3;&#x57CE;&#x6700;&#x535A;&#x5B66;&#x7684;&#x4EBA;&#xFF0C;&#x95E8;&#x5F92;&#x4E0A;&#x5343;&#xFF0C;&#x5F88;&#x591A;&#x83B7;&#x5F97;&#x4E86;&#x5B66;&#x58EB;&#x5B66;&#x4F4D;&#x4E4B;&#x540E;&#x53BB;&#x4E86;&#x4E2D;&#x539F;&#x8F85;&#x4F50;&#x8BF8;&#x4FAF;&#x3002;&#x53EA;&#x662F;&#x73B0;&#x5728;&#x8001;&#x4E86;&#xFF0C;&#x4ED6;&#x4E5F;&#x5F88;&#x5C11;&#x51FA;&#x56FE;&#x4E66;&#x9986;&#x7684;&#x95E8;&#x3002;</p>
<p>&#x201C;&#x5927;&#x5B66;&#x58EB;&#xFF0C;&#x65E5;&#x65B0;&#x60F3;&#x8BA9;&#x5C0F;&#x77F3;&#x5934;&#x548C;&#x60A8;&#x5728;&#x56FE;&#x4E66;&#x9986;&#x5B66;&#x4E60;&#xFF0C;&#x4ED6;&#x4E5F;&#x4E0D;&#x559C;&#x6B22;&#x4E60;&#x6B66;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x5426;&#x4F1A;&#x7ED9;&#x60A8;&#x6DFB;&#x9EBB;&#x70E6;&#xFF1F;&#x201D;&#x9676;&#x73B2;&#x884C;&#x4E86;&#x4E00;&#x4E2A;&#x793C;&#x3002;</p>
<p>&#x201C;&#x5594;&#x5594;&#x5475;&#x5475;&#x5475;&#x201D;&#x5927;&#x5B66;&#x58EB;&#x7B11;&#x4E86;&#x8D77;&#x6765;&#xFF0C;&#x8138;&#x4E0A;&#x7684;&#x76B1;&#x7EB9;&#x6324;&#x5728;&#x4E86;&#x4E00;&#x8D77;&#x3002;&#x80FD;&#x6709;&#x4E2A;&#x5C0F;&#x5B69;&#x5B50;&#x966A;&#x4ED6;&#xFF0C;&#x5927;&#x5B66;&#x662F;&#x8FD8;&#x662F;&#x5F88;&#x9AD8;&#x5174;&#x7684;&#x3002;</p>
<p>&#x201C;&#x597D;&#x554A;&#xFF0C;&#x597D;&#x554A;&#xFF0C;&#x5C0F;&#x77F3;&#x5934;&#x5750;&#x8FD9;&#x513F;&#x6765;&#xFF0C;&#x9676;&#x73B2;&#x4E5F;&#x5750;&#x5427;&#x201D;&#xFF0C;&#x5927;&#x5B66;&#x58EB;&#x793A;&#x610F;&#x6BCD;&#x5B50;&#x5750;&#x4E0B;&#xFF0C;&#x4ED6;&#x5F88;&#x559C;&#x6B22;&#x5C0F;&#x77F3;&#x5934;&#x3002;&#x201C;&#x5C0F;&#x77F3;&#x5934;&#x5C06;&#x6765;&#x60F3;&#x6210;&#x4E3A;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x4EBA;&#x5462;&#xFF1F;&#x201D;</p>
<p>&#x201C;&#x6211;&#x8981;&#x5F53;&#x9B54;&#x6CD5;&#x5E08;&#xFF01;&#x201D;&#xFF0C;&#x5C0F;&#x77F3;&#x5934;&#x5F88;&#x575A;&#x5B9A;&#x5730;&#x8BF4;&#x3002;</p>
<p>&#x201C;&#x5C0F;&#x77F3;&#x5934;&#xFF01;&#x201D;&#x9676;&#x73B2;&#x89C9;&#x5F97;&#x5C0F;&#x77F3;&#x5934;&#x7684;&#x53D1;&#x8A00;&#x8BA9;&#x5979;&#x5F88;&#x5C34;&#x5C2C;&#xFF0C;&#x62CD;&#x4E86;&#x4E00;&#x4E0B;&#x5C0F;&#x77F3;&#x5934;&#x7684;&#x624B;&#xFF0C;&#x867D;&#x7136;&#x7AE5;&#x8A00;&#x65E0;&#x5FCC;&#xFF0C;&#x4E0D;&#x8FC7;&#x5728;&#x5927;&#x5B66;&#x58EB;&#x9762;&#x524D;&#x8FD8;&#x662F;&#x8BF4;&#x4E2A;&#x6B63;&#x5E38;&#x70B9;&#x7684;&#x5B8F;&#x5927;&#x7406;&#x60F3;&#x6BD4;&#x8F83;&#x597D;&#x3002;</p>
<p>&#x201C;&#x5594;&#x5475;&#x5475;&#x5475;&#x5475;&#x5475;&#x201D;&#xFF0C;&#x5927;&#x5B66;&#x58EB;&#x53C8;&#x7B11;&#x4E86;&#x8D77;&#x6765;&#x3002;&#x201C;&#x9B54;&#x6CD5;&#x5E08;&#x597D;&#x554A;&#xFF01;&#x90A3;&#x4F60;&#x660E;&#x5929;&#x5F00;&#x59CB;&#x5C31;&#x8DDF;&#x7740;&#x6211;&#x5B66;&#x5427;&#x3002;&#x201D;</p>
<p>&#x9676;&#x73B2;&#x5F88;&#x9AD8;&#x5174;&#xFF0C;&#x5927;&#x5B66;&#x58EB;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x6EE1;&#x610F;&#xFF0C;&#x5979;&#x51B3;&#x5B9A;&#x5E26;&#x5C0F;&#x77F3;&#x5934;&#x53BB;&#x5341;&#x4E09;&#x8857;&#x4E70;&#x4E9B;&#x5C0F;&#x77F3;&#x5934;&#x559C;&#x6B22;&#x7684;&#x5C0F;&#x73A9;&#x610F;&#x513F;&#x3002;</p>
<p><a href="/2016/01/08/2015-12-20-novel/">&#x56DE;&#x5230;&#x76EE;&#x5F55;</a></p>


                
            </div>

            <!-- Comments -->
            
                <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                    


  <section id="comments">
    <!-- 多说评论框 start -->
    <div class="ds-thread" data-thread-key="post-novel-chapter-2" data-title="novel|Chapter II" data-url="http://Roger-luo.github.com/2016/01/08/novel-chapter-2/"></div>
    <!-- 多说评论框 end -->
    <!-- 多说公共JS代码 start (一个网页只需插入一次) -->
    <script type="text/javascript">
    var duoshuoQuery = {short_name:'rogerluo'};
      (function() {
        var ds = document.createElement('script');
        ds.type = 'text/javascript';ds.async = true;
        ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
        ds.charset = 'UTF-8';
        (document.getElementsByTagName('head')[0] 
         || document.getElementsByTagName('body')[0]).appendChild(ds);
        })();
            </script>
        <!-- 多说公共JS代码 end -->
    </section>

                </div>
            
        </div>
    </div>
</article>


    <!-- Footer -->
    <hr />

<!-- Footer -->
<footer>
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <ul class="list-inline text-center">
                    

                    

                    
                        <li>
                            <a href="https://github.com/Roger-luo" target="_blank">
                                <span class="fa-stack fa-lg">
                                    <i class="fa fa-circle fa-stack-2x"></i>
                                    <i class="fa fa-github fa-stack-1x fa-inverse"></i>
                                </span>
                            </a>
                        </li>
                    

                    
                        <li>
                            <a onclick="alert('Email me to get my wechat XD ')" target="_blank">
                                <span class="fa-stack fa-lg">
                                    <i class="fa fa-circle fa-stack-2x"></i>
                                    <i class="fa fa-wechat fa-stack-1x fa-inverse"></i>
                                </span>
                            </a>
                        </li>
                    

                    

                    
                        <li>
                            <a href="mailto:hiroger@qq.com" target="_blank">
                                <span class="fa-stack fa-lg">
                                    <i class="fa fa-circle fa-stack-2x"></i>
                                    <i class="fa fa-envelope-o fa-stack-1x fa-inverse"></i>
                                </span>
                            </a>
                        </li>
                    

                    
                </ul>
                
                <div class="copyright text-muted">
                    <div class="panel-heading">
                        <h4 class="panel-title">
                            <a data-toggle="collapse" data-parent="#accordion" href="#collapseOne">
                                Click to see Roger Luo's friends :-)
                            </a>
                        </h4>
                    </div>
                <div id="collapseOne" class="panel-collapse collapse">
                
                <p class="copyright text-muted" style="margin-top: 7px">
                <a target="_blank" href="http://crduan.cc">Chenru Duan</a>
                </p>
                
                <p class="copyright text-muted" style="margin-top: 7px">
                <a target="_blank" href="http://chenjunwang.com">Chenjun Wang</a>
                </p>
                
                </div>
                </div>

                
            </div>
        </div>
    </div>
</footer>


    <!-- After footer scripts -->
    
<!-- jQuery -->
<script src="//code.jquery.com/jquery-2.1.4.min.js"></script>

<!-- Bootstrap -->
<script src="//maxcdn.bootstrapcdn.com/bootstrap/3.3.6/js/bootstrap.min.js"></script>

<!-- Gallery -->
<script src="//cdnjs.cloudflare.com/ajax/libs/featherlight/1.3.5/featherlight.min.js" type="text/javascript" charset="utf-8"></script>

<!-- Waypoint -->
<script src="//cdnjs.cloudflare.com/ajax/libs/waypoints/4.0.1/noframework.waypoints.min.js" type="text/javascript" charset="utf-8"></script>

<!-- Disqus Comments -->
<!-- 
<script type="text/javascript">
    var disqus_shortname = 'rogerluo';

    (function(){
        var dsq = document.createElement('script');
        dsq.type = 'text/javascript';
        dsq.async = true;
        dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
        (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    }());
</script>
 -->

<!-- MathJax -->
<script type="text/x-mathjax-config">
    MathJax.Hub.Config({
        tex2jax: {
          inlineMath: [ ['$','$'], ["\\(","\\)"] ],
          displayMath: [ ['$$', '$$'], ["\\[", "\\]"] ],
          processEscapes: true
        },
        TeX: {
          equationNumbers: {
            autoNumber: 'AMS'
          }
        },
        "HTML-CSS": {
          imageFont: null
        }
      });
</script>

<script type="text/javascript" src="http://cdn.mathjax.org/mathjax/2.1-latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>

<div id="totop" style="position:fixed;bottom:20px;right:50px;cursor: pointer;">
    <span class="fa-stack fa-lg">
        <i class="fa fa-arrow-circle-up fa-stack-2x"></i>
    </span>
</div>


<script src="/js/totop.js"></script>


</body>

</html>