<!DOCTYPE html>
<html lang="en">

<!-- Head tag -->
<head>

    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">

    <!--Description-->
    
        <meta name="description" content="Not every post is provided with an English version (eg. novels)">
    

    <!--Author-->
    
        <meta name="author" content="Roger Luo">
    

    <!--Open Graph Title-->
    
        <meta property="og:title" content="记集智-凯风研读营"/>
    

    <!--Open Graph Description-->
    
        <meta property="og:description" content="Not every post is provided with an English version (eg. novels)" />
    

    <!--Open Graph Site Name-->
    <meta property="og:site_name" content="Half Integer"/>

    <!--Type page-->
    
        <meta property="og:type" content="article" />
    

    <!--Page Cover-->
    

        <meta name="twitter:card" content="summary" />
    

    <!-- Title -->
    
    <title>记集智-凯风研读营 - Half Integer</title>

    <!-- Bootstrap Core CSS -->
    <link href="//maxcdn.bootstrapcdn.com/bootstrap/3.3.6/css/bootstrap.min.css" rel="stylesheet"/>

    <!-- Custom CSS -->
    <link rel="stylesheet" href="/css/style.css">

    <!-- Custom Fonts -->
    <link href="//maxcdn.bootstrapcdn.com/font-awesome/4.6.3/css/font-awesome.min.css" rel="stylesheet" type="text/css">
    <link href="//fonts.googleapis.com/css?family=Lora:400,700,400italic,700italic" rel="stylesheet" type="text/css">
    <link href="//fonts.googleapis.com/css?family=Open+Sans:300italic,400italic,600italic,700italic,800italic,400,300,600,700,800" rel="stylesheet" type="text/css">

    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
    <script src="//oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
    <script src="//oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->

    <!-- Gallery -->
    <link href="//cdnjs.cloudflare.com/ajax/libs/featherlight/1.3.5/featherlight.min.css" type="text/css" rel="stylesheet" />

    <!-- Google Analytics -->
    


</head>


<body>

    <!-- Menu -->
    <!-- Navigation -->
<nav class="navbar navbar-default navbar-custom navbar-fixed-top">
    <div class="container-fluid">
        <!-- Brand and toggle get grouped for better mobile display -->
        <div class="navbar-header page-scroll">
            <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="/">Half Integer</a>
        </div>

        <!-- Collect the nav links, forms, and other content for toggling -->
        <div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
            <ul class="nav navbar-nav navbar-right">
                
                    <li>
                        <a href="https://Roger-luo.github.io/en/">
                            
                                English
                            
                        </a>
                    </li>
                
                    <li>
                        <a href="/">
                            
                                主页
                            
                        </a>
                    </li>
                
                    <li>
                        <a href="/cv">
                            
                                CV
                            
                        </a>
                    </li>
                
                    <li>
                        <a href="/codes">
                            
                                代码
                            
                        </a>
                    </li>
                
                    <li>
                        <a href="https://Roger-luo.github.io/slides/">
                            
                                幻灯片
                            
                        </a>
                    </li>
                
                    <li>
                        <a href="/archives">
                            
                                文档
                            
                        </a>
                    </li>
                
                    <li>
                        <a href="https://github.com/Roger-luo/Roger-luo.github.io">
                            
                                <i class="fa fa-github fa-stack-2x"></i>
                            
                        </a>
                    </li>
                
            </ul>
        </div>
        <!-- /.navbar-collapse -->
    </div>
    <!-- /.container -->
</nav>

    <!-- Main Content -->
    <!-- Page Header -->
<!-- Set your background image for this header in your post front-matter: cover -->

<header class="post-header" style="background-image: url('/img/home-bg-2.jpg')">
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <div class="post-heading">
                    <h1>记集智-凯风研读营</h1>
                    
                    <span class="meta">
                        <!-- Date and Author -->
                        
                        2016-10-13
                    </span>
                </div>
            </div>
        </div>
    </div>
</header>

<!-- Post Content -->
<article>
    <div class="container">
        <div class="row">

            <!-- Tags and categories -->
           
                <div class="col-lg-4 col-lg-offset-2 col-md-5 col-md-offset-1 post-tags">
                    
                        


<a href="/tags/随便写写/">#随便写写</a>


                    
                </div>
                <div class="col-lg-4 col-md-5 post-categories">
                    
                </div>
            

            <!-- Gallery -->
            

            <!-- Post Main Content -->
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <h1 id="xie-zai-qian-mian">&#x5199;&#x5728;&#x524D;&#x9762; <a href="#xie-zai-qian-mian" class="header-anchor">#</a></h1>
<p>&#x53C2;&#x52A0;&#x96C6;&#x667A;&#x7814;&#x8BFB;&#x8425;&#x8D77;&#x521D;&#x662F;&#x56E0;&#x4E3A;&#x770B;&#x5230;&#x4E86;&#x670B;&#x53CB;&#x5708;&#x91CC;&#x6709;&#x4EBA;&#x8F6C;&#x53D1;&#x5085;&#x6E25;&#x6210;&#x5728;&#x77E5;&#x4E4E;&#x91CC;&#x7684;<strong>&#x5E7F;&#x544A;</strong>&#x3002;&#x3002;&#x3002;&#x53D1;&#x73B0;&#x4E3B;&#x9898;&#x548C;&#x6211;&#x60F3;&#x8981;&#x505A;&#x7684;&#x65B9;&#x5411;&#xFF08;&#x91CF;&#x5B50;&#x4FE1;&#x606F;&amp;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#xFF0C;&#x5177;&#x4F53;&#x4E00;&#x70B9;&#x53EF;&#x80FD;&#x662F;&#x5F20;&#x91CF;&#x7F51;&#x7EDC;&#xFF0C;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x548C;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#xFF09;&#x5F88;&#x76F8;&#x5173;&#xFF0C;&#x770B;&#x5230;&#x6211;&#x4EEC;&#x5B66;&#x6821;&#x4E5F;&#x6709;&#x540C;&#x5B66;&#xFF08;&#x7AE0;&#x5F66;&#x535A;&#xFF09;&#x53BB;&#xFF0C;&#x62B1;&#x7740;&#x8BD5;&#x8BD5;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x53D1;&#x4E86;&#x4E00;&#x5C01;&#x90AE;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x3002;&#x3002;&#x3002;&#x6211;&#x5C31;&#x6765;&#x4E86;&#x3002;&#x3002;&#x3002;&#x4E00;&#x5F00;&#x59CB;&#x4EE5;&#x4E3A;&#x4F1A;&#x5728;&#x5317;&#x4EAC;&#x7684;&#x67D0;&#x4E2A;&#x5496;&#x5561;&#x5385;&#x6216;&#x8005;&#x5B66;&#x6821;&#xFF0C;&#x540E;&#x6765;&#x624D;&#x53D1;&#x73B0;&#x662F;&#x5728;&#x53E4;&#x5317;&#x6C34;&#x9547;&#xFF0C;&#x4E00;&#x4E2A;&#x5F88;&#x6F02;&#x4EAE;&#x7684;&#x5C0F;&#x9547;&#xFF0C;&#x4F1A;&#x8D34;&#x4E00;&#x4E9B;&#x7167;&#x7247;&#xFF0C;&#x7136;&#x540E;&#x611F;&#x89C9;&#x8FD9;&#x4E2A;&#x57FA;&#x91D1;&#x4F1A;&#x597D;&#x571F;&#x8C6A;&#x3002;&#x3002;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x7814;&#x8BFB;&#x8425;&#x91CC;&#x6070;&#x597D;&#x62C9;&#x5230;&#x4E86;&#x4E00;&#x4E9B;&#x5085;&#x6E25;&#x6210;&#x548C;symcheng&#x8FD9;&#x6837;&#x7684;<strong>&#x5927;V</strong>&#x60F3;&#x4E00;&#x8D77;&#x7EF4;&#x62A4;&#x4E00;&#x4E2A;blog&#xFF0C;&#x4E3B;&#x9898;&#x5927;&#x7EA6;&#x4F1A;&#x56F4;&#x7ED5;&#x5728;&#x6211;&#x4EEC;&#x51E0;&#x4E2A;&#x7684;&#x4E13;&#x4E1A;&#x9886;&#x57DF;&#x91CC;&#xFF08;&#x6211;&#x4F30;&#x8BA1;&#x4E3B;&#x8981;&#x4F1A;&#x662F;&#x51DD;&#x805A;&#x6001;&#xFF0C;&#x91CF;&#x5B50;&#x4FE1;&#x606F;&#xFF0C;&#x9762;&#x5411;&#x6570;&#x503C;&#x8BA1;&#x7B97;&#x7684;&#x7F16;&#x7A0B;&#x8FD9;&#x6837;&#x4E09;&#x4E2A;&#x9886;&#x57DF;&#xFF09;&#x3002;&#x6211;&#x4EEC;&#x521D;&#x6B65;&#x7684;&#x6253;&#x7B97;&#x662F;&#x7528;github pages&#xFF0C;&#x4F1A;&#x5EFA;&#x4E00;&#x4E2A;org&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x8FD8;&#x6CA1;&#x60F3;&#x597D;&#x65B0;blog&#x53EB;&#x5565;&#x3002;&#x7136;&#x540E;&#x6211;&#x53C8;&#x5B89;&#x5229;&#x4E86;&#x4E00;&#x6CE2;Julia&#x8BED;&#x8A00;&#x2026;</p>
<h1 id="jiang-liao-sha">&#x8BB2;&#x4E86;&#x5565; <a href="#jiang-liao-sha" class="header-anchor">#</a></h1>
<p>&#x4E2A;&#x4EBA;&#x611F;&#x89C9;&#x7814;&#x8BFB;&#x8425;&#x7684;&#x8BA8;&#x8BBA;&#x4E3B;&#x8981;&#x56F4;&#x7ED5;&#x7740;<a href="http://wiki.swarma.net/index.php/%E5%A4%8D%E6%9D%82%E7%BD%91%E7%BB%9C" target="_blank" rel="external">&#x590D;&#x6742;&#x7F51;&#x7EDC;</a>&#xFF0C;<a href="http://wiki.swarma.net/index.php/%E5%8F%8C%E6%9B%B2%E7%A9%BA%E9%97%B4%E6%A8%A1%E5%9E%8B" target="_blank" rel="external">&#x53CC;&#x66F2;&#x51E0;&#x4F55;</a>&#xFF0C;<a href="http://www.bing.com/knows/search?q=%E9%87%8F%E5%AD%90%E7%89%A9%E7%90%86%E5%AD%A6&amp;mkt=zh-cn" target="_blank" rel="external">&#x91CF;&#x5B50;&#x7269;&#x7406;</a>&#xFF0C;<a href="http://www.bing.com/knows/search?q=%E7%BB%9F%E8%AE%A1%E7%89%A9%E7%90%86%E5%AD%A6&amp;go=%E6%90%9C%E7%B4%A2&amp;qs=n&amp;form=QBRE&amp;pq=%E7%BB%9F%E8%AE%A1%E7%89%A9%E7%90%86%E5%AD%A6&amp;sc=8-5&amp;sp=-1&amp;sk=&amp;cvid=1F8BD2A644EA4614BA2B28B099AAF106&amp;mkt=zh-cn" target="_blank" rel="external">&#x7EDF;&#x8BA1;&#x7269;&#x7406;</a>&#x548C;<a href="http://www.bing.com/knows/search?q=%E6%9C%BA%E5%99%A8%E5%AD%A6%E4%B9%A0&amp;mkt=zh-cn&amp;FORM=BKACAI" target="_blank" rel="external">&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;</a>&#x5C55;&#x5F00;&#x3002;&#x6211;&#x5728;&#x6765;&#x4E4B;&#x524D;&#x7684;&#x4E2A;&#x4EBA;&#x77E5;&#x8BC6;&#x80CC;&#x666F;&#x662F;&#x6BD4;&#x8F83;&#x6D45;&#x7684;&#xFF0C;&#x867D;&#x7136;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x548C;&#x91CF;&#x5B50;&#x7269;&#x7406;&#x90FD;&#x6709;&#x6D89;&#x730E;&#xFF0C;&#x4E0D;&#x8FC7;&#x90FD;&#x53EA;&#x4F1A;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x7684;&#xFF0C;&#x7136;&#x540E;&#x5F20;&#x91CF;&#x7F51;&#x7EDC;&#x5728;&#x6765;&#x4E4B;&#x524D;&#x51E0;&#x5468;&#x5F00;&#x59CB;&#x770B;&#x7684;&#x3002;&#xFF08;&#x7136;&#x540E;&#x611F;&#x89C9;&#x8FD9;&#x6B21;&#x6700;&#x5927;&#x7684;&#x6536;&#x83B7;&#x662F;&#x6211;&#x95EE;&#x7740;&#x7A0B;&#x5D69;&#x548C;&#x5C24;&#x4EA6;&#x5E84;&#x628A;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x5F20;&#x91CF;&#x7F51;&#x7EDC;&#x7684;&#x5185;&#x5BB9;&#x7ED9;&#x8FC7;&#x4E86;&#xFF0C;&#x624B;&#x52A8;&#x7B11;&#x54ED;&#xFF09;&#x3002;&#x8BF4;&#x51E0;&#x4E2A;&#x8FD9;&#x6B21;&#x542C;&#x5230;&#x7684;&#x51E0;&#x4E2A;&#x6BD4;&#x8F83;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x4E2A;&#x5F88;&#x6709;&#x610F;&#x601D;&#x7684;&#x662F;&#x5C24;&#x4EA6;&#x5E84;&#x5B66;&#x957F;&#x8BB2;&#x7684;&#x4ECE;&#x968F;&#x673A;&#x5F20;&#x91CF;&#x7F51;&#x7EDC;&#x91CC;&#x627E;&#x51E0;&#x4F55;&#x673A;&#x6784;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x5F88;&#x81EA;&#x7136;&#x7684;&#x51FA;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x73BB;&#x5C14;&#x5179;&#x66FC;&#x673A;&#xFF0C;&#x4E8E;&#x662F;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x7528;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x65B9;&#x6CD5;&#x83B7;&#x5F97;&#x8FD9;&#x4E2A;&#x51E0;&#x4F55;&#x7ED3;&#x6784;&#xFF08;tensor&#x4E4B;&#x95F4;&#x7684;&#x8FDE;&#x63A5;&#xFF09;&#x3002;&#x8FD9;&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x505A;&#x662F;&#x4E00;&#x79CD;&#x65F6;&#x7A7A;&#x7ED3;&#x6784;&#x7684;&#x89E3;&#x91CA;&#xFF1A;&#x7A7A;&#x95F4;&#x7684;&#x7ED3;&#x6784;&#x662F;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x73BB;&#x5C14;&#x5179;&#x66FC;&#x673A;&#x6765;&#x5B66;&#x4E60;&#x5B87;&#x5B99;&#x4E2D;&#x5927;&#x91CF;&#x7684;&#x91CF;&#x5B50;&#x6001;&#x8BAD;&#x7EC3;&#x51FA;&#x6765;&#x7684;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#x5168;&#x8FDE;&#x63A5;&#x7684;&#x73BB;&#x5C14;&#x5179;&#x66FC;&#x673A;&#x662F;&#x5F88;&#x96BE;&#x8BAD;&#x7EC3;&#x7684;&#x3002;&#x4E8E;&#x662F;&#x5C31;&#x60F3;&#x5230;&#x4E86;&#x5E74;&#x521D;&#x7684;&#x90A3;&#x7BC7;&#x91CF;&#x5B50;&#x73BB;&#x5C14;&#x5179;&#x66FC;&#x673A;&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x4E4B;&#x524D;&#x6211;&#x4EE5;&#x4E3A;&#x7814;&#x7A76;&#x91CF;&#x5B50;&#x73BB;&#x5C14;&#x5179;&#x66FC;&#x673A;&#x7684;&#x51FA;&#x53D1;&#x70B9;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x5F88;&#x96BE;&#x7B97;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x80FD;&#x7528;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x73B0;&#x5728;&#x7684;&#x611F;&#x89C9;&#x662F;&#x91CF;&#x5B50;&#x8BA1;&#x7B97;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x4E00;&#x79CD;&#x7406;&#x89E3;&#x7269;&#x7406;&#x4E16;&#x754C;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x7136;&#x540E;&#x5C31;&#x662F;GAN&#x6A21;&#x578B;&#x548C;&#x505A;&#x7EDF;&#x8BA1;&#x7269;&#x7406;&#x7684;&#x4EBA;&#x505A;&#x7684;&#x73BB;&#x5C14;&#x5179;&#x66FC;&#x673A;&#x611F;&#x89C9;&#x5F88;&#x6709;&#x610F;&#x601D;&#xFF0C;&#x7136;&#x800C;&#x51E0;&#x5929;&#x65F6;&#x95F4;&#x611F;&#x89C9;&#x8FD8;&#x4E0D;&#x591F;&#x6211;&#x5B8C;&#x5168;&#x5F04;&#x61C2;&#xFF0C;&#x8981;&#x4E86;&#x4E00;&#x4E9B;&#x5165;&#x95E8;&#x7684;&#x6750;&#x6599;&#x56DE;&#x6765;&#x5B66;&#x4E60;&#x3002;&#x5176;&#x5B83;&#x4E3B;&#x9898;&#x6211;&#x89C9;&#x5F97;&#x5C31;&#x4E3B;&#x8981;&#x662F;&#x51E0;&#x4F55;&#x548C;&#x7F51;&#x7EDC;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5F00;&#x4E86;&#x4E00;&#x4E9B;&#x628A;&#x7F51;&#x7EDC;&#x95EE;&#x9898;&#x5728;&#x91CF;&#x5B50;&#x7269;&#x7406;&#x4E0B;&#x6C42;&#x89E3;&#x7684;&#x8111;&#x6D1E;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x4E9B;&#x60F3;&#x6CD5;&#x4E5F;&#x8FD8;&#x5F88;&#x4E0D;&#x6210;&#x719F;&#xFF0C;&#x6216;&#x8005;&#x5176;&#x5B9E;&#x662F;&#x6709;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x5565;&#x65F6;&#x5019;&#x8BD5;&#x51FA;&#x6765;&#x9760;&#x8C31;&#x7684;&#x4E86;&#x518D;&#x8BF4;&#x5427;&#x3002;&#x6700;&#x540E;&#x662F;&#x5434;&#x4EE4;&#x98DE;&#x4ECB;&#x7ECD;&#x7684;ISOMAP&#xFF0C;&#x6D41;&#x5F62;&#x5B66;&#x4E60;&#x7684;&#x7B97;&#x6CD5;&#x3002;&#x6D41;&#x5F62;&#x5B66;&#x4E60;&#x4E4B;&#x524D;&#x6709;&#x542C;&#x8BF4;&#x8FC7;&#x4F46;&#x662F;&#x4E00;&#x76F4;&#x6CA1;&#x6709;&#x53BB;&#x770B;&#xFF0C;&#x611F;&#x89C9;&#x6709;&#x4EBA;&#x8BB2;&#x4EE5;&#x540E;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x5F88;&#x591A;&#x3002;&#x603B;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x4E3B;&#x8981;&#x7684;&#x6536;&#x8D27;&#x662F;&#x4E86;&#x89E3;&#x4E86;&#x4E00;&#x4E9B;&#x76F8;&#x5173;&#x9886;&#x57DF;&#x7684;&#x524D;&#x6CBF;&#x5DE5;&#x4F5C;&#xFF0C;&#x5177;&#x4F53;&#x7684;&#x7406;&#x8BBA;&#x5E76;&#x6CA1;&#x6709;&#x5B66;&#x4F1A;&#xFF08;&#x53EF;&#x80FD;&#x8FD8;&#x662F;&#x6211;&#x592A;&#x6E23;OTZ&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x51C6;&#x5907;1&#x6708;&#x4EFD;&#x7533;&#x8BF7;&#x7684;&#x4E8B;&#x60C5;&#x57FA;&#x672C;&#x7ED3;&#x675F;&#x81EA;&#x5DF1;&#x597D;&#x597D;&#x628A;&#x8FD9;&#x6B21;&#x7684;&#x76F8;&#x5173;&#x6587;&#x732E;&#x6D88;&#x5316;&#x4E00;&#x4E0B;&#x3002;&#x4E8E;&#x662F;&#x6211;&#x53C8;get&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x6587;&#x732E;&#x7684;list OTZ</p>
<h1 id="zhao-pian-men">&#x7167;&#x7247;&#x4EEC; <a href="#zhao-pian-men" class="header-anchor">#</a></h1>
<p>&#x7136;&#x540E;&#x867D;&#x7136;&#x62A5;&#x544A;&#x548C;&#x8BA8;&#x8BBA;&#x662F;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x4F11;&#x606F;&#x5730;&#x4ECE;&#x65E9;&#x4E0A;8:30&#x5230;&#x665A;&#x4E0A;5:30&#xFF0C;&#x7136;&#x540E;&#x5230;&#x4E86;&#x665A;&#x4E0A;&#x8FD8;&#x6709;&#x8BA8;&#x8BBA;&#xFF0C;&#x4E0D;&#x8FC7;&#x6211;&#x4EEC;&#x4E5F;&#x8FD8;&#x662F;&#x5728;&#x8FD9;&#x8FB9;&#x7684;&#x666F;&#x533A;&#x91CC;&#x8F6C;&#x4E86;&#x8F6C;&#x7684;&#xFF0C;&#x6700;&#x540E;&#x4E00;&#x5929;&#x4E0B;&#x5348;&#x8FD8;&#x722C;&#x4E86;&#x4E00;&#x4E0B;&#x53F8;&#x9A6C;&#x53F0;&#x957F;&#x57CE;&#x3002;&#x6240;&#x4EE5;&#x8FD8;&#x662F;&#x62CD;&#x4E86;&#x4E0D;&#x5C11;&#x7167;&#x7247;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x98CE;&#x666F;&#x5F88;&#x68D2;&#x7684;&#x5730;&#x65B9;&#x8BA8;&#x8BBA;&#x95EE;&#x9898;&#x7684;&#x611F;&#x89C9;&#x5F88;&#x68D2;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x6211;&#x548C;&#x7A0B;&#x5D69;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x5728;&#x8FD9;&#x4E2A;&#x9547;&#x5B50;&#x91CC;&#x968F;&#x673A;&#x6E38;&#x8D70;&#x2026;&#x540E;&#x6765;&#x4ECE;Jake&#x90A3;&#x91CC;&#x5F97;&#x77E5;&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x5728;&#x4E00;&#x8D77;&#x968F;&#x673A;&#x6E38;&#x8D70;&#x2026;</p>
<ul>
<li>&#x5927;&#x7EA6;&#x662F;&#x8BA8;&#x8BBA;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;&#x4E0D;&#x77E5;&#x9053;&#x7ECF;&#x8FC7;&#x4E86;&#x7684;&#x4E00;&#x4E2A;&#x4EC0;&#x4E48;&#x5730;&#x65B9; <em>via symcheng</em></li>
</ul>
<div class="figure">
<img src="/images/17374520.jpg">

</div>
<ul>
<li>&#x7167;&#x7167;&#x7247;&#x8FD9;&#x91CC;&#x6709;&#x5BB6;&#x9E21;&#x6392;&#x5F88;&#x597D;&#x5403; <em>via symcheng</em></li>
</ul>
<div class="figure">
<img src="/images/36089842.jpg">

</div>
<ul>
<li>&#x4ECE;&#x53F8;&#x9A6C;&#x53F0;&#x957F;&#x57CE;&#x4E0B;&#x6765;&#x7684;&#x65F6;&#x5019;&#x770B;&#x5230;&#x4E00;&#x9762;&#x5F88;&#x6F02;&#x4EAE;&#x7684;&#x5899; <em>via symcheng</em></li>
</ul>
<div class="figure">
<img src="/images/142219266.jpg">

</div>
<ul>
<li>&#x53F8;&#x9A6C;&#x53F0;&#x957F;&#x57CE;&#xFF0C;&#x597D;&#x50CF;&#x662F;&#x7B2C;&#x516D;&#x4E2A;&#x53F0;&#x5B50;&#x8FD9;&#x91CC;&#x62CD;&#x7684;&#xFF1F; <em>via symcheng</em></li>
</ul>
<div class="figure">
<img src="/images/1028356119.jpg">

</div>
<ul>
<li>&#x5F88;&#x53E4;&#x98CE;&#x7684;&#x8001;&#x5EFA;&#x7B51; <em>via symcheng</em></li>
</ul>
<div class="figure">
<img src="/images/1126749863.jpg">

</div>
<ul>
<li>&#x5929;&#xFF01;&#x8FD8;&#x6709;&#x597D;&#x8FDC;&#x8981;&#x8D70;&#xFF01; <em>via symcheng</em></li>
</ul>
<div class="figure">
<img src="/images/169716065.jpg">

</div>
<ul>
<li>symcheng &#x6447;&#x6447;&#x6643;&#x6643;&#x5730;&#x5728;&#x77F3;&#x5934;&#x4E0A;&#x8FB9;&#x62CD;&#x7684;</li>
</ul>
<div class="figure">
<img src="/images/518170196.jpg">

</div>
<ul>
<li>&#x6865;&#x4E0A;&#x62CD;&#x7684;&#x591C;&#x666F; <em>via Roger</em></li>
</ul>
<div class="figure">
<img src="/images/243670233.jpg">

</div>
<ul>
<li>&#x4E91;&#x6790;&#x5149;&#xFF0C;&#x4E0D;&#x8FC7;&#x53EF;&#x80FD;&#x8FD8;&#x9700;&#x8981;&#x505A;&#x4E0B;&#x540E;&#x671F; <em>via Roger</em></li>
</ul>
<div class="figure">
<img src="/images/254843576.jpg">

</div>
<ul>
<li>&#x5728;&#x957F;&#x57CE;&#x4E0A;&#x62CD;&#x7684; <em>via Roger</em></li>
</ul>
<div class="figure">
<img src="/images/360347153.jpg">

</div>
<ul>
<li>&#x524D;&#x4E24;&#x5929;blog&#x7684;&#x5C01;&#x9762; <em>via Roger</em></li>
</ul>
<div class="figure">
<img src="/images/2059230371.jpg">

</div>
<p>&#x7531;&#x4E8E;&#x7A0B;&#x5D69;&#x662F;&#x4E13;&#x4E1A;&#x7684;&#x6444;&#x5F71;&#x7231;&#x597D;&#x8005;&#xFF0C;&#x4E8E;&#x662F;&#x6211;&#x4EEC;&#x62CD;&#x4E86;&#x5F88;&#x591A;&#x7167;&#x7247;&#xFF0C;&#x7136;&#x540E;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x662F;&#x66F4;&#x4E13;&#x4E1A;&#x7684;&#x6444;&#x5F71;&#x5E08;&#x6735;&#x6735;&#x7684;&#x62CD;&#x7684;&#x7167;&#x7247;&#x3002;&#x7531;&#x4E8E;blog&#x662F;&#x5B8C;&#x5168;&#x516C;&#x5F00;&#x7684;&#xFF0C;&#x9732;&#x8138;&#x7684;&#x6211;&#x5C31;&#x53D1;&#x7968;&#x5708;&#x5566;&#xFF5E;</p>
<h1 id="zui-hou">&#x6700;&#x540E; <a href="#zui-hou" class="header-anchor">#</a></h1>
<p>&#x5E72;&#x8D27;&#x4EC0;&#x4E48;&#x7684;&#x53EA;&#x80FD;&#x7B49;&#x597D;&#x597D;&#x8BFB;&#x5B8C;&#x6587;&#x732E;&#x518D;&#x5199;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x4F9D;&#x7136;&#x8981;&#x62D6;&#x5230;1&#x6708;&#x4EFD;&#x4E86;&#x3002;&#x4E0D;&#x8FC7;&#x662F;&#x7684;&#xFF0C;&#x6211;&#x5927;&#x7EA6;&#x8981;&#x6162;&#x6162;&#x6062;&#x590D;blog&#x7684;&#x7EF4;&#x62A4;&#x4E86;&#xFF0C;&#x4E70;&#x4E86;&#x4E09;&#x5E74;&#x7684;&#x65B0;&#x57DF;&#x540D;&#xFF1A;rogerluo.me&#x3002;&#x6B22;&#x8FCE;&#x5173;&#x6CE8;&#x54C8; :-)</p>


                
            </div>

            <!-- Comments -->
            
                <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                    


  <section id="comments">
    <!-- 多说评论框 start -->
    <div class="ds-thread" data-thread-key="post-swarma" data-title="记集智-凯风研读营" data-url="http://Roger-luo.github.com/2016/10/13/swarma/"></div>
    <!-- 多说评论框 end -->
    <!-- 多说公共JS代码 start (一个网页只需插入一次) -->
    <script type="text/javascript">
    var duoshuoQuery = {short_name:'rogerluo'};
      (function() {
        var ds = document.createElement('script');
        ds.type = 'text/javascript';ds.async = true;
        ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
        ds.charset = 'UTF-8';
        (document.getElementsByTagName('head')[0] 
         || document.getElementsByTagName('body')[0]).appendChild(ds);
        })();
            </script>
        <!-- 多说公共JS代码 end -->
    </section>

                </div>
            
        </div>
    </div>
</article>


    <!-- Footer -->
    <hr />

<!-- Footer -->
<footer>
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <ul class="list-inline text-center">
                    

                    

                    
                        <li>
                            <a href="https://github.com/Roger-luo" target="_blank">
                                <span class="fa-stack fa-lg">
                                    <i class="fa fa-circle fa-stack-2x"></i>
                                    <i class="fa fa-github fa-stack-1x fa-inverse"></i>
                                </span>
                            </a>
                        </li>
                    

                    
                        <li>
                            <a onclick="alert('Email me to get my wechat XD ')" target="_blank">
                                <span class="fa-stack fa-lg">
                                    <i class="fa fa-circle fa-stack-2x"></i>
                                    <i class="fa fa-wechat fa-stack-1x fa-inverse"></i>
                                </span>
                            </a>
                        </li>
                    

                    

                    
                        <li>
                            <a href="mailto:hiroger@qq.com" target="_blank">
                                <span class="fa-stack fa-lg">
                                    <i class="fa fa-circle fa-stack-2x"></i>
                                    <i class="fa fa-envelope-o fa-stack-1x fa-inverse"></i>
                                </span>
                            </a>
                        </li>
                    

                    
                </ul>
                
                <div class="copyright text-muted">
                    <div class="panel-heading">
                        <h4 class="panel-title">
                            <a data-toggle="collapse" data-parent="#accordion" href="#collapseOne">
                                Click to see Roger Luo's friends :-)
                            </a>
                        </h4>
                    </div>
                <div id="collapseOne" class="panel-collapse collapse">
                
                <p class="copyright text-muted" style="margin-top: 7px">
                <a target="_blank" href="http://crduan.cc">Chenru Duan</a>
                </p>
                
                <p class="copyright text-muted" style="margin-top: 7px">
                <a target="_blank" href="http://chenjunwang.com">Chenjun Wang</a>
                </p>
                
                </div>
                </div>

                
            </div>
        </div>
    </div>
</footer>


    <!-- After footer scripts -->
    
<!-- jQuery -->
<script src="//code.jquery.com/jquery-2.1.4.min.js"></script>

<!-- Bootstrap -->
<script src="//maxcdn.bootstrapcdn.com/bootstrap/3.3.6/js/bootstrap.min.js"></script>

<!-- Gallery -->
<script src="//cdnjs.cloudflare.com/ajax/libs/featherlight/1.3.5/featherlight.min.js" type="text/javascript" charset="utf-8"></script>

<!-- Waypoint -->
<script src="//cdnjs.cloudflare.com/ajax/libs/waypoints/4.0.1/noframework.waypoints.min.js" type="text/javascript" charset="utf-8"></script>

<!-- Disqus Comments -->
<!-- 
<script type="text/javascript">
    var disqus_shortname = 'rogerluo';

    (function(){
        var dsq = document.createElement('script');
        dsq.type = 'text/javascript';
        dsq.async = true;
        dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
        (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    }());
</script>
 -->

<!-- MathJax -->
<script type="text/x-mathjax-config">
    MathJax.Hub.Config({
        tex2jax: {
          inlineMath: [ ['$','$'], ["\\(","\\)"] ],
          displayMath: [ ['$$', '$$'], ["\\[", "\\]"] ],
          processEscapes: true
        },
        TeX: {
          equationNumbers: {
            autoNumber: 'AMS'
          }
        },
        "HTML-CSS": {
          imageFont: null
        }
      });
</script>

<script type="text/javascript" src="http://cdn.mathjax.org/mathjax/2.1-latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>

<div id="totop" style="position:fixed;bottom:150px;right:50px;cursor: pointer;">
    <span class="fa-stack fa-lg">
        <i class="fa fa-arrow-circle-up fa-stack-2x"></i>
    </span>
</div>


<script src="/js/totop.js"></script>


</body>

</html>