<!DOCTYPE html>
<html lang="en">

<!-- Head tag -->
<head>

    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">

    <!--Description-->
    
        <meta name="description" content="Not every post is provided with an English version (eg. novels)">
    

    <!--Author-->
    
        <meta name="author" content="Roger Luo">
    

    <!--Open Graph Title-->
    
        <meta property="og:title" content="novel|Chapter III"/>
    

    <!--Open Graph Description-->
    
        <meta property="og:description" content="Not every post is provided with an English version (eg. novels)" />
    

    <!--Open Graph Site Name-->
    <meta property="og:site_name" content="Half Integer"/>

    <!--Type page-->
    
        <meta property="og:type" content="article" />
    

    <!--Page Cover-->
    

        <meta name="twitter:card" content="summary" />
    

    <!-- Title -->
    
    <title>novel|Chapter III - Half Integer</title>

    <!-- Bootstrap Core CSS -->
    <link href="//maxcdn.bootstrapcdn.com/bootstrap/3.3.6/css/bootstrap.min.css" rel="stylesheet"/>

    <!-- Custom CSS -->
    <link rel="stylesheet" href="/css/style.css">

    <!-- Custom Fonts -->
    <link href="//maxcdn.bootstrapcdn.com/font-awesome/4.6.3/css/font-awesome.min.css" rel="stylesheet" type="text/css">
    <link href="//fonts.googleapis.com/css?family=Lora:400,700,400italic,700italic" rel="stylesheet" type="text/css">
    <link href="//fonts.googleapis.com/css?family=Open+Sans:300italic,400italic,600italic,700italic,800italic,400,300,600,700,800" rel="stylesheet" type="text/css">

    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
    <script src="//oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
    <script src="//oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->

    <!-- Gallery -->
    <link href="//cdnjs.cloudflare.com/ajax/libs/featherlight/1.3.5/featherlight.min.css" type="text/css" rel="stylesheet" />

    <!-- Google Analytics -->
    


</head>


<body>

    <!-- Menu -->
    <!-- Navigation -->
<nav class="navbar navbar-default navbar-custom navbar-fixed-top">
    <div class="container-fluid">
        <!-- Brand and toggle get grouped for better mobile display -->
        <div class="navbar-header page-scroll">
            <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="/">Half Integer</a>
        </div>

        <!-- Collect the nav links, forms, and other content for toggling -->
        <div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
            <ul class="nav navbar-nav navbar-right">
                
                    <li>
                        <a href="https://Roger-luo.github.io/en/">
                            
                                English
                            
                        </a>
                    </li>
                
                    <li>
                        <a href="/">
                            
                                主页
                            
                        </a>
                    </li>
                
                    <li>
                        <a href="/cv">
                            
                                CV
                            
                        </a>
                    </li>
                
                    <li>
                        <a href="/codes">
                            
                                代码
                            
                        </a>
                    </li>
                
                    <li>
                        <a href="https://Roger-luo.github.io/slides/">
                            
                                幻灯片
                            
                        </a>
                    </li>
                
                    <li>
                        <a href="/archives">
                            
                                文档
                            
                        </a>
                    </li>
                
                    <li>
                        <a href="https://github.com/Roger-luo/Roger-luo.github.io">
                            
                                <i class="fa fa-github fa-stack-2x"></i>
                            
                        </a>
                    </li>
                
            </ul>
        </div>
        <!-- /.navbar-collapse -->
    </div>
    <!-- /.container -->
</nav>

    <!-- Main Content -->
    <!-- Page Header -->
<!-- Set your background image for this header in your post front-matter: cover -->

<header class="post-header" style="background-image: url('/img/home-bg-2.jpg')">
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <div class="post-heading">
                    <h1>novel|Chapter III</h1>
                    
                    <span class="meta">
                        <!-- Date and Author -->
                        
                        2016-01-08
                    </span>
                </div>
            </div>
        </div>
    </div>
</header>

<!-- Post Content -->
<article>
    <div class="container">
        <div class="row">

            <!-- Tags and categories -->
           
                <div class="col-lg-4 col-lg-offset-2 col-md-5 col-md-offset-1 post-tags">
                    
                        


<a href="/tags/novel/">#novel</a>


                    
                </div>
                <div class="col-lg-4 col-md-5 post-categories">
                    
                </div>
            

            <!-- Gallery -->
            

            <!-- Post Main Content -->
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <h2 id="luo-yi">&#x7F57;&#x6C49; <a href="#luo-yi" class="header-anchor">#</a></h2>
<p>&#x7F57;&#x6C49;&#x662F;&#x5BB6;&#x91CC;&#x7684;&#x957F;&#x5B50;&#xFF0C;&#x4ED6;&#x89C9;&#x5F97;&#x7537;&#x4EBA;&#x5C31;&#x662F;&#x8981;&#x70ED;&#x8840;&#xFF0C;&#x7537;&#x4EBA;&#x5C31;&#x662F;&#x5E94;&#x8BE5;&#x4E60;&#x6B66;&#x4E3A;&#x8363;&#x3002;&#x5FE0;&#x4E49;&#x4E3A;&#x5148;&#xFF0C;&#x6218;&#x6B7B;&#x6C99;&#x573A;&#x3002;&#x6BCF;&#x5929;&#x65E9;&#x4E0A;&#x5F88;&#x65E9;&#x90FD;&#x4F1A;&#x5728;&#x6B66;&#x9986;&#x7EC3;&#x5251;&#xFF0C;&#x4ED6;&#x7684;&#x5251;&#x672F;&#x662F;&#x8D6B;&#x77F3;&#x57CE;&#x519B;&#x4E2D;&#x7684;&#x603B;&#x6559;&#x5934;&#x5F20;&#x6BC5;&#x4EB2;&#x6388;&#x3002;&#x5F20;&#x6BC5;&#x5E74;&#x8FD1;&#x56DB;&#x5341;&#xFF0C;16&#x5F00;&#x59CB;&#x4ECE;&#x519B;&#xFF0C;&#x6B66;&#x6280;&#x53F7;&#x79F0;&#x897F;&#x5317;&#x7B2C;&#x4E00;&#x3002;&#x5728;&#x8D6B;&#x77F3;&#x57CE;&#x7684;&#x6B66;&#x9986;&#x91CC;&#x5B66;&#x827A;&#x7684;&#x6709;&#x4E0B;&#x5C42;&#x7684;&#x58EB;&#x5175;&#xFF0C;&#x4E5F;&#x6709;&#x4F4E;&#x7EA7;&#x7684;&#x519B;&#x5B98;&#xFF0C;&#x7F57;&#x6C49;&#x5E38;&#x5E38;&#x548C;&#x4ED6;&#x4EEC;&#x4E00;&#x8D77;&#x5BF9;&#x7EC3;&#xFF0C;&#x6DF1;&#x53D7;&#x5927;&#x5BB6;&#x7231;&#x6234;&#x3002;&#x5927;&#x5BB6;&#x90FD;&#x89C9;&#x5F97;&#x4ED6;&#x4F1A;&#x662F;&#x672A;&#x6765;&#x7684;&#x57CE;&#x4E3B;&#xFF0C;&#x7F57;&#x6C49;&#x81EA;&#x5DF1;&#x4E5F;&#x8FD9;&#x4E48;&#x89C9;&#x5F97;&#xFF0C;&#x53EF;&#x662F;&#x57CE;&#x4E3B;&#x5927;&#x4EBA;&#x603B;&#x89C9;&#x5F97;&#x7F57;&#x6C49;&#x8FD8;&#x662F;&#x7F3A;&#x4E4F;&#x4E00;&#x4E9B;&#x5176;&#x5B83;&#x65B9;&#x9762;&#x7684;&#x6280;&#x80FD;&#xFF0C;&#x53EA;&#x4F1A;&#x5251;&#x672F;&#x662F;&#x4E0D;&#x884C;&#x7684;&#x3002;</p>
<p>&#x65E9;&#x4E0A;&#x5E26;&#x7740;&#x4ED6;&#x90A3;&#x4F53;&#x5F31;&#x7684;&#x5F1F;&#x5F1F;&#x7EC3;&#x4E86;&#x6CA1;&#x591A;&#x4E45;&#xFF0C;&#x5F1F;&#x5F1F;&#x5C31;&#x88AB;&#x6BCD;&#x4EB2;&#x63A5;&#x8D70;&#x4E86;&#x3002;&#x6BCD;&#x4EB2;&#x53C8;&#x5520;&#x53E8;&#x5A36;&#x4EB2;&#x7684;&#x4E8B;&#x60C5;&#x4E86;&#xFF0C;&#x53EF;&#x662F;&#x7231;&#x60C5;&#x8FD9;&#x79CD;&#x4E8B;&#x60C5;&#xFF0C;&#x7F57;&#x6C49;&#x4E00;&#x76F4;&#x89C9;&#x5F97;&#x987A;&#x5176;&#x81EA;&#x7136;&#x662F;&#x6700;&#x597D;&#x7684;&#xFF0C;&#x73B0;&#x5728;&#x5BF9;&#x4E00;&#x4E2A;&#x771F;&#x6B63;&#x7684;&#x7537;&#x5B50;&#x6C49;&#x6765;&#x8BB2;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#x5E72;&#x51FA;&#x4E00;&#x756A;&#x4E8B;&#x4E1A;&#x6765;&#x3002;</p>
<p>&#x4E8E;&#x662F;&#xFF0C;&#x62FF;&#x8D77;&#x4E00;&#x5757;&#x6BDB;&#x5DFE;&#x64E6;&#x4E86;&#x64E6;&#x6C57;&#xFF0C;&#x7F57;&#x6C49;&#x7EE7;&#x7EED;&#x548C;&#x5176;&#x4ED6;&#x4EBA;&#x5BF9;&#x7EC3;&#x3002;</p>
<p>&#x4E0D;&#x77E5;&#x4E0D;&#x89C9;&#x5C31;&#x5230;&#x4E86;&#x6B63;&#x5348;&#xFF0C;&#x4ECA;&#x5929;&#x7684;&#x7EC3;&#x4E60;&#x4E5F;&#x5DEE;&#x4E0D;&#x591A;&#x4E86;&#x3002;&#x4E0B;&#x5348;&#x9700;&#x8981;&#x4EE3;&#x7236;&#x4EB2;&#x53BB;&#x5341;&#x4E09;&#x5DF7;&#x51C6;&#x5907;&#x660E;&#x5E74;&#x6625;&#x5B63;&#x8868;&#x6F14;&#x7684;&#x70DF;&#x706B;&#x3002;&#x6625;&#x5B63;&#x8868;&#x6F14;&#x662F;&#x8D6B;&#x77F3;&#x57CE;&#x6700;&#x91CD;&#x8981;&#x7684;&#x65E5;&#x5B50;&#x4E4B;&#x4E00;&#xFF0C;&#x867D;&#x7136;&#x662F;&#x5546;&#x4E1A;&#x57CE;&#x5E02;&#xFF0C;&#x4F46;&#x662F;&#x4ECE;&#x53E4;&#x65F6;&#x5019;&#x4F20;&#x4E0B;&#x6765;&#x5E86;&#x795D;&#x6625;&#x5929;&#x7684;&#x4E60;&#x4FD7;&#x4F9D;&#x7136;&#x6CA1;&#x53D8;&#x3002;</p>
<p>&#x201C;&#x9A6C;&#x6797;!&#x201D;&#xFF0C;&#x7F57;&#x6C49;&#x558A;&#x6765;&#x4ED6;&#x7684;&#x968F;&#x4ECE;&#x3002;&#x201C;&#x7ED9;&#x6211;&#x5907;&#x8F66;&#xFF0C;&#x6211;&#x8981;&#x53BB;&#x5341;&#x4E09;&#x5DF7;&#x3002;&#x201D;</p>
<p>&#x201C;&#x597D;&#x7684;&#xFF0C;&#x5C11;&#x7237;&#x3002;&#x4E0D;&#x8FC7;&#x5C11;&#x7237;&#xFF0C;&#x60A8;&#x4E0D;&#x5403;&#x996D;&#x5417;&#xFF1F;&#x201D;</p>
<p>&#x201C;&#x5148;&#x5907;&#x8F66;&#x5427;&#xFF0C;&#x5230;&#x5341;&#x4E09;&#x5DF7;&#x518D;&#x8BF4;&#x201D;</p>
<p>&#x5341;&#x4E09;&#x5DF7;&#x662F;&#x8D6B;&#x77F3;&#x57CE;&#x7684;&#x6587;&#x5316;&#x4E2D;&#x5FC3;&#x5728;&#x57CE;&#x5317;&#x7684;&#x8D2B;&#x6C11;&#x533A;&#xFF0C;&#x8FD9;&#x91CC;&#x805A;&#x96C6;&#x7740;&#x5404;&#x8272;&#x7684;&#x827A;&#x672F;&#x5BB6;&#xFF0C;&#x5DE5;&#x5320;&#x3002;&#x5176;&#x4E2D;&#x6700;&#x8457;&#x540D;&#x7684;&#x662F;&#x8FD1;&#x5E74;&#x6765;&#x7684;&#x65B0;&#x79C0;&#x9646;&#x747E;&#xFF0C;&#x4EBA;&#x79F0;&#x9646;&#x5927;&#x5E08;&#x3002;&#x9646;&#x5927;&#x5E08;&#x662F;&#x5168;&#x624D;&#x578B;&#x7684;&#xFF0C;&#x867D;&#x7136;&#x53EA;&#x6709;&#x4E09;&#x5341;&#x51FA;&#x5934;&#xFF0C;&#x4F46;&#x4ED6;&#x7684;&#x7ED8;&#x753B;&#xFF0C;&#x96D5;&#x523B;&#xFF0C;&#x620F;&#x5267;&#x5267;&#x672C;&#x4EE4;&#x4EBA;&#x79F0;&#x8D5E;&#xFF0C;&#x4ED6;&#x4E5F;&#x4F1A;&#x5236;&#x9020;&#x5343;&#x5947;&#x767E;&#x602A;&#x7684;&#x70DF;&#x706B;&#xFF0C;&#x8FD8;&#x5E38;&#x5E38;&#x53D1;&#x660E;&#x4E00;&#x4E9B;&#x795E;&#x5947;&#x7684;&#x673A;&#x62EC;&#xFF0C;&#x6539;&#x8FDB;&#x4E00;&#x4E9B;&#x73B0;&#x6709;&#x7684;&#x673A;&#x68B0;&#xFF0C;&#x6BD4;&#x5982;&#x8D6B;&#x77F3;&#x57CE;&#x7684;&#x5F29;&#x5C31;&#x7ECF;&#x8FC7;&#x4ED6;&#x7684;&#x6539;&#x826F;&#x3002;&#x4ED6;&#x6709;&#x65F6;&#x8FD8;&#x53BB;&#x6B66;&#x9986;&#x548C;&#x7F57;&#x6C49;&#x5207;&#x78CB;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x5355;&#x751F;&#x610F;&#x7F57;&#x6C49;&#x81EA;&#x7136;&#x662F;&#x6765;&#x627E;&#x9646;&#x747E;&#x4E86;&#x3002;</p>
<p>&#x9646;&#x747E;&#x7684;&#x5DE5;&#x4F5C;&#x5BA4;&#x517C;&#x4F4F;&#x6240;&#x770B;&#x8D77;&#x6765;&#x8981;&#x6BD4;&#x5185;&#x57CE;&#x7B80;&#x964B;&#xFF0C;&#x6837;&#x5F0F;&#x662F;&#x5927;&#x79E6;&#x82B1;&#x54E8;&#x7684;&#x5C16;&#x5854;&#x5F0F;&#x4E0E;&#x4E1C;&#x65B9;&#x7684;&#x6728;&#x5C4B;&#x98DE;&#x6A90;&#x76F8;&#x7ED3;&#x5408;&#x7684;&#x5947;&#x602A;&#x7EC4;&#x5408;&#x3002;&#x7A97;&#x6237;&#x662F;&#x81EA;&#x5DF1;&#x7ED8;&#x5236;&#x7684;&#x4E09;&#x8272;&#x7409;&#x7483;&#xFF0C;&#x4E00;&#x5171;&#x6709;&#x4E09;&#x5EA7;&#x5854;&#x697C;&#xFF0C;&#x4E00;&#x5EA7;&#x8F83;&#x9AD8;&#xFF0C;&#x6709;&#x4E09;&#x5C42;&#xFF0C;&#x4E24;&#x5EA7;&#x8F83;&#x77EE;&#x53EA;&#x6709;&#x4E24;&#x5C42;&#xFF0C;&#x4E5F;&#x8F83;&#x4E3A;&#x7B80;&#x964B;&#xFF0C;&#x4F3C;&#x4E4E;&#x662F;&#x4F9D;&#x9644;&#x4E09;&#x5C42;&#x5854;&#x697C;&#x800C;&#x5EFA;&#x7684;&#x7A9D;&#x68DA;&#x3002;&#x800C;&#x8FD9;&#x4E09;&#x5EA7;&#x5854;&#x697C;&#x5468;&#x56F4;&#x53C8;&#x642D;&#x7740;&#x5927;&#x5927;&#x5C0F;&#x5C0F;&#x7684;&#x7B80;&#x964B;&#x5927;&#x5E10;&#x7BF7;&#xFF0C;&#x91CC;&#x9762;&#x6446;&#x7740;&#x5404;&#x79CD;&#x96D5;&#x50CF;&#xFF0C;&#x4F5C;&#x54C1;&#x3002;</p>
<p>&#x5341;&#x4E09;&#x5DF7;&#x603B;&#x662F;&#x4EBA;&#x5934;&#x7A9C;&#x52A8;&#xFF0C;&#x9A6C;&#x8F66;&#x5F00;&#x8FDB;&#x53BB;&#x603B;&#x662F;&#x5F88;&#x96BE;&#x51FA;&#x6765;&#x3002;&#x7F57;&#x6C49;&#x8BA9;&#x8F66;&#x592B;&#x628A;&#x8F66;&#x505C;&#x5728;&#x5916;&#x9762;&#xFF0C;&#x81EA;&#x5DF1;&#x548C;&#x9A6C;&#x6797;&#x8D70;&#x4E86;&#x8FDB;&#x53BB;&#x3002;&#x5DE5;&#x4F5C;&#x5BA4;&#x91CC;&#x9646;&#x747E;&#x7684;&#x8001;&#x5E08;&#xFF0C;&#x66FE;&#x5148;&#x751F;&#x6B63;&#x5728;&#x548C;&#x5B66;&#x5F92;&#x4EEC;&#x96D5;&#x523B;&#x4E00;&#x5EA7;&#x5DE8;&#x5927;&#x7684;&#x96D5;&#x50CF;&#x3002;</p>
<p>&#x201C;&#x9646;&#x747E;&#xFF01;&#xFF01;&#xFF01;&#x201D;&#x7F57;&#x6C49;&#x4E5F;&#x4E0D;&#x7BA1;&#x522B;&#x4EBA;&#xFF0C;&#x5148;&#x5F00;&#x59CB;&#x558A;&#x9646;&#x747E;&#x3002;</p>
<p>&#x201C;&#x5927;&#x4EBA;&#xFF0C;&#x9646;&#x747E;&#x5728;&#x4E0A;&#x9762;&#x201D;&#x66FE;&#x5148;&#x751F;&#x6307;&#x4E86;&#x6307;&#x90A3;&#x5EA7;&#x4E09;&#x5C42;&#x7684;&#x5854;&#x697C;&#x3002;</p>
<p>&#x201C;&#x4ECE;&#x54EA;&#x4E0A;&#x53BB;&#xFF1F;&#x201D;&#x66FE;&#x5148;&#x751F;&#x53C8;&#x6307;&#x4E86;&#x6307;&#x4E00;&#x65C1;&#x7684;&#x6728;&#x8D28;&#x68AF;&#x5B50;&#x3002;&#x201C;&#x9A6C;&#x6797;&#xFF0C;&#x90A3;&#x4F60;&#x7559;&#x8FD9;&#x513F;&#x7B49;&#x6211;&#x5427;&#x201D;</p>
<p>&#x7F57;&#x6C49;&#x81EA;&#x987E;&#x81EA;&#x5730;&#x722C;&#x4E86;&#x4E0A;&#x53BB;&#x3002;&#x9646;&#x747E;&#x6B63;&#x5728;&#x6446;&#x5F04;&#x4E00;&#x6839;&#x5927;&#x7BA1;&#x5B50;&#x7684;&#x73A9;&#x610F;&#xFF0C;&#x201C;&#x8FD9;&#x53EB;&#x671B;&#x8FDC;&#x955C;&#xFF0C;&#x4E1C;&#x8FB9;&#x6765;&#x7684;&#x4E00;&#x4E2A;&#x5B66;&#x8005;&#x5E26;&#x6765;&#x7684;&#x65B9;&#x6848;&#xFF0C;&#x6211;&#x628A;&#x5B83;&#x6539;&#x8FDB;&#x4E86;&#xFF0C;&#x6765;&#x4F60;&#x4ECE;&#x8FD9;&#x91CC;&#x770B;&#x201D;</p>
<p>&#x7F57;&#x6C49;&#x53D1;&#x73B0;&#x8D6B;&#x77F3;&#x57CE;&#x7684;&#x5927;&#x90E8;&#x5206;&#x5EFA;&#x7B51;&#x5728;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x91CC;&#x4E00;&#x89C8;&#x65E0;&#x4F59;&#xFF0C;&#x201C;&#x4F60;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x591A;&#x5C11;&#x94B1;&#xFF1F;&#x6211;&#x4E70;&#x4E86;&#x3002;&#x201D;</p>
<p>&#x201C;&#x4E0D;&#x5FC5;&#xFF0C;&#x6211;&#x7ED9;&#x4F60;&#x505A;&#x4E86;&#x4E2A;&#x5C0F;&#x7684;&#x3002;&#x5F53;&#x662F;&#x8FD9;&#x5355;&#x751F;&#x610F;&#x7684;&#x8D60;&#x54C1;&#x597D;&#x4E86;&#x3002;&#x4F60;&#x5148;&#x6765;&#x770B;&#x770B;&#x6211;&#x7684;&#x70DF;&#x706B;&#x65B9;&#x6848;&#x662F;&#x5426;&#x6EE1;&#x610F;&#x5427;&#xFF0C;&#x5982;&#x679C;&#x6EE1;&#x610F;&#x6211;&#x4EEC;&#x5C31;&#x628A;&#x5408;&#x540C;&#x7B7E;&#x4E86;&#x3002;&#x201D;&#x8D6B;&#x77F3;&#x57CE;&#x5546;&#x4E1A;&#x6C1B;&#x56F4;&#x6D53;&#x91CD;&#xFF0C;&#x4E00;&#x5207;&#x4EE5;&#x5408;&#x540C;&#x4E3A;&#x51C6;&#x3002;</p>
<p>&#x7F57;&#x6C49;&#x4E5F;&#x6CA1;&#x5FC3;&#x601D;&#x7EC6;&#x770B;&#x70DF;&#x706B;&#x65B9;&#x6848;&#xFF0C;&#x4ED6;&#x4FE1;&#x4EFB;&#x9646;&#x747E;&#xFF0C;&#x76F8;&#x4FE1;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x5929;&#x624D;&#x505A;&#x51FA;&#x6765;&#x7684;&#x4E1C;&#x897F;&#x5FC5;&#x7136;&#x4E5F;&#x662F;&#x9707;&#x64BC;&#x7684;&#xFF0C;&#x5230;&#x65F6;&#x5019;&#x5E02;&#x6C11;&#x5E94;&#x8BE5;&#x4F1A;&#x6EE1;&#x610F;&#x7684;&#x3002;&#x8349;&#x8349;&#x770B;&#x4E86;&#x4E00;&#x904D;&#x89C9;&#x5F97;&#x5E76;&#x65E0;&#x4E0D;&#x59A5;&#x4E4B;&#x5904;&#xFF0C;&#x5C31;&#x7B7E;&#x4E86;&#x5408;&#x540C;&#xFF0C;1000&#x4E2A;&#x91D1;&#x5E01;&#xFF0C;&#x4E0D;&#x7B97;&#x591A;&#x4E5F;&#x4E0D;&#x7B97;&#x5C11;&#x3002;</p>
<p>&#x201C;&#x7F57;&#x6C49;&#xFF0C;&#x6709;&#x4EF6;&#x4E8B;&#x6211;&#x9700;&#x8981;&#x544A;&#x8BC9;&#x4F60;&#x3002;&#x201D;&#xFF0C;&#x9646;&#x747E;&#x7A81;&#x7136;&#x53D8;&#x5F97;&#x4E25;&#x8083;&#x8D77;&#x6765;&#x3002;&#x9646;&#x747E;&#x76EE;&#x5149;&#x626B;&#x8FC7;&#x56DB;&#x5468;&#xFF0C;&#x786E;&#x5B9A;&#x4E86;&#x56DB;&#x4E0B;&#x65E0;&#x4EBA;&#xFF0C;&#x201C;&#x6211;&#x6628;&#x5929;&#x5728;&#x671B;&#x8FDC;&#x955C;&#x4E2D;&#x770B;&#x5230;&#x897F;&#x8FB9;&#x6CDB;&#x7EA2;&#xFF0C;&#x5C31;&#x535C;&#x6D4B;&#x4E86;&#x4E00;&#x4E0B;&#x5366;&#x8C61;&#xFF0C;&#x897F;&#x8FB9;&#x7684;&#x5927;&#x79E6;&#x53EF;&#x80FD;&#x8981;&#x6D88;&#x5931;&#x4E86;&#x3002;&#x8D6B;&#x77F3;&#x57CE;&#x53EF;&#x80FD;&#x4E5F;&#x8981;&#x9762;&#x4E34;&#x5371;&#x9669;&#xFF0C;&#x8FD9;&#x4E5F;&#x8BB8;&#x548C;&#x9B54;&#x6CD5;&#x6709;&#x5173;&#x3002;&#x201D;</p>
<p>&#x201C;&#x9B54;&#x6CD5;&#xFF1F;&#x4F60;&#x7AE5;&#x8BDD;&#x6545;&#x4E8B;&#x542C;&#x591A;&#x4E86;&#x5417;&#xFF1F;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x65E9;&#x5C31;&#x6CA1;&#x6709;&#x9B54;&#x6CD5;&#x4E86;&#x3002;&#x4E0D;&#x8981;&#x5236;&#x9020;&#x8FD9;&#x6837;&#x7684;&#x8C23;&#x8A00;&#xFF0C;&#x5426;&#x5219;&#x5C31;&#x7B97;&#x662F;&#x4F60;&#xFF0C;&#x4E5F;&#x8981;&#x6B7B;&#x5728;&#x7EDE;&#x5211;&#x67B6;&#x4E0A;&#x3002;&#x201D;</p>
<p>&#x201C;&#x4F60;&#x542C;&#x6211;&#x8BF4;&#x5B8C;&#x3002;&#x201D;&#x9646;&#x747E;&#x770B;&#x4ED6;&#x4E0D;&#x4FE1;&#xFF0C;&#x6709;&#x4E9B;&#x6025;&#x4E86;&#x3002;&#x201C;&#x6211;&#x6628;&#x5929;&#x60F3;&#x518D;&#x770B;&#x770B;&#x5927;&#x79E6;&#x662F;&#x4E3A;&#x4F55;&#x6D88;&#x5931;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x94DC;&#x94B1;&#x81EA;&#x5DF1;&#x5C31;&#x788E;&#x4E86;&#xFF0C;&#x4F20;&#x8BF4;&#x4E2D;&#x53EA;&#x6709;&#x5F3A;&#x5927;&#x7684;&#x9B54;&#x6CD5;&#x624D;&#x4F1A;&#x8BA9;&#x535C;&#x5E01;&#x65E0;&#x6545;&#x7834;&#x788E;&#x3002;&#x201D;</p>
<p>&#x201C;&#x4F60;&#x6CA1;&#x4E8B;&#x5427;&#xFF1F;&#x524D;&#x51E0;&#x5929;&#x8FD8;&#x6709;&#x5927;&#x79E6;&#x7684;&#x5546;&#x4EBA;&#x6765;&#x6211;&#x5BB6;&#x9001;&#x793C;&#xFF0C;&#x5927;&#x79E6;&#x5360;&#x636E;&#x897F;&#x65B9;&#xFF0C;&#x6C11;&#x98CE;&#x5C1A;&#x6B66;&#xFF0C;&#x519B;&#x961F;&#x900D;&#x52C7;&#x5584;&#x6218;&#xFF0C;&#x6709;&#x5341;&#x4E07;&#x7CBE;&#x5175;&#xFF0C;&#x600E;&#x4E48;&#x4F1A;&#x8BF4;&#x6CA1;&#x5C31;&#x6CA1;&#x4E86;&#x5462;&#xFF1F;&#x201D;&#x7F57;&#x6C49;&#x5FC3;&#x91CC;&#x89C9;&#x5F97;&#x597D;&#x7B11;&#xFF0C;&#x201C;&#x6211;&#x529D;&#x4F60;&#x4F60;&#x522B;&#x518D;&#x548C;&#x522B;&#x4EBA;&#x8BF4;&#x8FD9;&#x4EF6;&#x4E8B;&#x4E86;&#xFF0C;&#x4E0D;&#x7136;&#x4F1A;&#x88AB;&#x4EBA;&#x5F53;&#x6210;&#x75AF;&#x5B50;&#x7684;&#xFF0C;&#x8FD8;&#x9B54;&#x6CD5;&#xFF0C;&#x4F60;&#x89C9;&#x5F97;&#x4F1A;&#x6709;&#x4EBA;&#x4FE1;&#x5417;&#xFF1F;&#x201D;</p>
<p>&#x201C;&#x6211;&#x5F53;&#x7136;&#x77E5;&#x9053;&#xFF0C;&#x53EF;&#x662F;&#x4F60;&#x77E5;&#x9053;&#x5927;&#x79E6;&#x7684;&#x897F;&#x9762;&#x53C8;&#x6709;&#x4EC0;&#x4E48;&#x5417;&#xFF1F;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x8BA4;&#x8BC6;&#x591A;&#x5C11;&#x5E74;&#x4E86;&#xFF1F;&#x6211;&#x5F53;&#x4F60;&#x662F;&#x5144;&#x5F1F;&#xFF0C;&#x4F60;&#x4E5F;&#x5982;&#x6B64;&#x3002;&#x4F60;&#x8981;&#x76F8;&#x4FE1;&#x6211;&#x201D;&#xFF0C;&#x9646;&#x747E;&#x8138;&#x4E0A;&#x8D8A;&#x6765;&#x8D8A;&#x4E25;&#x8083;&#x4E86;&#x3002;</p>
<p>&#x201C;&#x5927;&#x79E6;&#x7684;&#x897F;&#x9762;&#x6709;&#x4EC0;&#x4E48;&#xFF1F;&#x201D;&#x7F57;&#x6C49;&#x8FD8;&#x771F;&#x6CA1;&#x60F3;&#x8FC7;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x8D6B;&#x77F3;&#x57CE;&#x5468;&#x56F4;&#x90FD;&#x662F;&#x5927;&#x6208;&#x58C1;&#xFF0C;&#x8352;&#x829C;&#x4EBA;&#x70DF;&#x3002;&#x53EA;&#x6709;&#x8D6B;&#x77F3;&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x6761;&#x5730;&#x4E0B;&#x6CB3;&#xFF0C;&#x65B9;&#x80FD;&#x5EFA;&#x57CE;&#xFF0C;&#x8D6B;&#x77F3;&#x57CE;&#x79BB;&#x5C71;&#x811A;&#x4E0D;&#x8FDC;&#xFF0C;&#x5357;&#x9762;&#x662F;&#x5929;&#x5C71;&#x5C71;&#x8109;&#xFF0C;&#x5728;&#x57CE;&#x91CC;&#x5C31;&#x80FD;&#x770B;&#x5230;&#x3002;&#x7FFB;&#x8FC7;&#x5929;&#x5C71;&#x5C31;&#x662F;&#x6606;&#x4ED1;&#x9AD8;&#x539F;&#xFF0C;&#x9AD8;&#x539F;&#x90E8;&#x65CF;&#x51F6;&#x608D;&#x6392;&#x5916;&#xFF0C;&#x7D20;&#x4E0D;&#x4E0E;&#x5916;&#x4EBA;&#x5F80;&#x6765;&#x3002;&#x5F80;&#x897F;&#xFF0C;&#x5148;&#x8981;&#x7A7F;&#x8FC7;&#x4E00;&#x671B;&#x65E0;&#x9645;&#x7684;&#x5927;&#x6208;&#x58C1;&#xFF0C;&#x624D;&#x80FD;&#x5230;&#x8FBE;&#x5927;&#x79E6;&#x3002;&#x6240;&#x4EE5;&#x8D6B;&#x77F3;&#x57CE;&#x5BF9;&#x4E8E;&#x5927;&#x71D5;&#x7684;&#x4E86;&#x89E3;&#x4EC5;&#x9650;&#x4E8E;&#x6765;&#x5F80;&#x7684;&#x5546;&#x4EBA;&#xFF0C;&#x800C;&#x5E76;&#x65E0;&#x5B98;&#x65B9;&#x7684;&#x4EA4;&#x5F80;&#x3002;&#x800C;&#x4E1C;&#x9762;&#x662F;&#x5272;&#x636E;&#x4E2D;&#x539F;&#x7684;&#x5404;&#x4E2A;&#x8BF8;&#x4FAF;&#x56FD;&#xFF0C;&#x8BF8;&#x4FAF;&#x4ECE;&#x5341;&#x5E74;&#x524D;&#x7684;&#x653F;&#x53D8;&#x5F00;&#x59CB;&#x5206;&#x636E;&#x5404;&#x81EA;&#x7684;&#x9886;&#x5730;&#xFF0C;&#x5341;&#x5E74;&#x6765;&#x8C01;&#x4E5F;&#x6CA1;&#x80FD;&#x7EDF;&#x4E00;&#x4E2D;&#x539F;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x8F83;&#x5927;&#x7684;&#x6218;&#x4E8B;&#x3002;&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;&#x897F;&#x65B9;&#x5927;&#x71D5;&#x4E0D;&#x4F1A;&#x9020;&#x6210;&#x5A01;&#x80C1;&#xFF0C;&#x8BF8;&#x4FAF;&#x5012;&#x662F;&#x5BF9;&#x652F;&#x6301;&#x8D6B;&#x77F3;&#x57CE;&#x90FD;&#x6CA1;&#x6709;&#x610F;&#x89C1;&#x3002;&#x800C;&#x53C8;&#x4E0D;&#x597D;&#x541E;&#x5E76;&#xFF0C;&#x8C01;&#x90FD;&#x77E5;&#x9053;&#x541E;&#x5E76;&#x8D6B;&#x77F3;&#x57CE;&#x610F;&#x5473;&#x7740;&#x8981;&#x7EDF;&#x4E00;&#x4E2D;&#x539F;&#xFF0C;&#x4E00;&#x5BB6;&#x72EC;&#x5927;&#x3002;&#x4F1A;&#x53D7;&#x5230;&#x5176;&#x5B83;&#x4EBA;&#x7684;&#x56F4;&#x653B;&#x3002;&#x8D6B;&#x77F3;&#x57CE;&#x4E5F;&#x56E0;&#x6B64;&#x72EC;&#x7ACB;&#xFF0C;&#x5E76;&#x59CB;&#x7EC8;&#x4FDD;&#x6301;&#x4E2D;&#x7ACB;&#x3002;</p>
<p>&#x4F46;&#x5927;&#x79E6;&#x7684;&#x897F;&#x9762;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x8FD8;&#x771F;&#x6CA1;&#x6709;&#x4EBA;&#x8BF4;&#x8D77;&#x8FC7;&#x3002;&#x7F57;&#x6C49;&#x6447;&#x4E86;&#x6447;&#x5934;&#x3002;</p>
<p>&#x201C;&#x5728;&#x5927;&#x79E6;&#x7684;&#x897F;&#x9762;&#xFF0C;&#x636E;&#x8BF4;&#x662F;&#x4E00;&#x7247;&#x88AB;&#x51B0;&#x5C01;&#x7684;&#x5927;&#x6D77;&#xFF0C;&#x6D77;&#x91CC;&#x4F4F;&#x7740;&#x4E0A;&#x53E4;&#x7684;&#x6076;&#x9B54;&#xFF0C;&#x6D77;&#x6C34;&#x89E3;&#x51BB;&#x4E4B;&#x65F6;&#x2026;&#x201D;</p>
<p>&#x201C;&#x8FD9;&#x4E2A;&#x6211;&#x77E5;&#x9053;&#xFF0C;&#x5C0F;&#x65F6;&#x5019;&#x542C;&#x738B;&#x5988;&#x7684;&#x6545;&#x4E8B;&#x91CC;&#x8BB2;&#x8FC7;&#xFF0C;&#x5927;&#x9646;&#x7684;&#x6781;&#x897F;&#x662F;&#x6076;&#x9B54;&#x4E4B;&#x6D77;&#xFF0C;&#x4E0A;&#x53E4;&#x7684;&#x65F6;&#x5019;&#x88AB;&#x516D;&#x4F4D;&#x5929;&#x795E;&#x5C06;&#x4E3A;&#x7978;&#x5927;&#x9646;&#xFF0C;&#x6D82;&#x78B3;&#x751F;&#x7075;&#x7684;&#x5927;&#x6076;&#x9B54;&#x51BB;&#x5728;&#x4E86;&#x6D77;&#x91CC;&#xFF0C;&#x4EBA;&#x7C7B;&#x624D;&#x5F97;&#x4EE5;&#x7E41;&#x884D;&#x3002;&#x597D;&#x4E86;&#xFF0C;&#x4F60;&#x4E0D;&#x8981;&#x518D;&#x8BF4;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#x4E86;&#xFF0C;&#x8D6B;&#x77F3;&#x57CE;&#x7531;&#x6211;&#x7956;&#x4E0A;&#x8BBE;&#x8BA1;&#x5EFA;&#x9020;&#xFF0C;&#x73B0;&#x5728;&#x53C8;&#x6709;&#x4E2D;&#x539F;&#x516D;&#x5927;&#x8BF8;&#x4FAF;&#x4F5C;&#x4E3A;&#x540E;&#x76FE;&#xFF0C;&#x5C31;&#x7B97;&#x662F;&#x5927;&#x79E6;&#x7684;&#x5341;&#x4E07;&#x5F6A;&#x9A91;&#xFF0C;&#x60F3;&#x6253;&#x6211;&#x8D6B;&#x77F3;&#x4E5F;&#x8981;&#x6382;&#x91CF;&#x6382;&#x91CF;&#xFF0C;&#x6211;&#x5F53;&#x4ECA;&#x5929;&#x4F60;&#x4EC0;&#x4E48;&#x90FD;&#x6CA1;&#x8BF4;&#x8FC7;&#xFF0C;&#x54B1;&#x4EEC;&#x4ECA;&#x5929;&#x53BB;&#x5403;&#x70B9;&#x597D;&#x7684;&#xFF0C;&#x5C31;&#x53BB;&#x9648;&#x8BB0;&#x5403;&#x5427;&#x201D;</p>
<p>&#x201C;&#x5509;&#xFF0C;&#x597D;&#x5427;&#x3002;&#x201D;</p>
<p><a href="/2016/01/08/2015-12-20-novel/">&#x56DE;&#x5230;&#x76EE;&#x5F55;</a></p>


                
            </div>

            <!-- Comments -->
            
                <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                    


  <section id="comments">
    <!-- 多说评论框 start -->
    <div class="ds-thread" data-thread-key="post-novel-chapter-3" data-title="novel|Chapter III" data-url="http://Roger-luo.github.com/2016/01/08/novel-chapter-3/"></div>
    <!-- 多说评论框 end -->
    <!-- 多说公共JS代码 start (一个网页只需插入一次) -->
    <script type="text/javascript">
    var duoshuoQuery = {short_name:'rogerluo'};
      (function() {
        var ds = document.createElement('script');
        ds.type = 'text/javascript';ds.async = true;
        ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
        ds.charset = 'UTF-8';
        (document.getElementsByTagName('head')[0] 
         || document.getElementsByTagName('body')[0]).appendChild(ds);
        })();
            </script>
        <!-- 多说公共JS代码 end -->
    </section>

                </div>
            
        </div>
    </div>
</article>


    <!-- Footer -->
    <hr />

<!-- Footer -->
<footer>
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <ul class="list-inline text-center">
                    

                    

                    
                        <li>
                            <a href="https://github.com/Roger-luo" target="_blank">
                                <span class="fa-stack fa-lg">
                                    <i class="fa fa-circle fa-stack-2x"></i>
                                    <i class="fa fa-github fa-stack-1x fa-inverse"></i>
                                </span>
                            </a>
                        </li>
                    

                    
                        <li>
                            <a onclick="alert('Email me to get my wechat XD ')" target="_blank">
                                <span class="fa-stack fa-lg">
                                    <i class="fa fa-circle fa-stack-2x"></i>
                                    <i class="fa fa-wechat fa-stack-1x fa-inverse"></i>
                                </span>
                            </a>
                        </li>
                    

                    

                    
                        <li>
                            <a href="mailto:hiroger@qq.com" target="_blank">
                                <span class="fa-stack fa-lg">
                                    <i class="fa fa-circle fa-stack-2x"></i>
                                    <i class="fa fa-envelope-o fa-stack-1x fa-inverse"></i>
                                </span>
                            </a>
                        </li>
                    

                    
                        <li>
                            <a id="totop_bottom">
                                <span class="fa-stack fa-lg">
                                    <i class="fa fa-arrow-circle-up fa-stack-2x"></i>
                                </span>
                            </a>
                        </li>
                </ul>
                
                <div class="copyright text-muted">
                    <div class="panel-heading">
                        <h4 class="panel-title">
                            <a data-toggle="collapse" data-parent="#accordion" href="#collapseOne">
                                Click to see Roger Luo's friends :-)
                            </a>
                        </h4>
                    </div>
                <div id="collapseOne" class="panel-collapse collapse">
                
                <p class="copyright text-muted" style="margin-top: 7px">
                <a target="_blank" href="http://crduan.cc">Chenru Duan</a>
                </p>
                
                <p class="copyright text-muted" style="margin-top: 7px">
                <a target="_blank" href="http://chenjunwang.com">Chenjun Wang</a>
                </p>
                
                </div>
                </div>

                
            </div>
        </div>
    </div>
</footer>


    <!-- After footer scripts -->
    
<!-- jQuery -->
<script src="//code.jquery.com/jquery-2.1.4.min.js"></script>

<!-- Bootstrap -->
<script src="//maxcdn.bootstrapcdn.com/bootstrap/3.3.6/js/bootstrap.min.js"></script>

<!-- Gallery -->
<script src="//cdnjs.cloudflare.com/ajax/libs/featherlight/1.3.5/featherlight.min.js" type="text/javascript" charset="utf-8"></script>

<!-- Waypoint -->
<script src="//cdnjs.cloudflare.com/ajax/libs/waypoints/4.0.1/noframework.waypoints.min.js" type="text/javascript" charset="utf-8"></script>

<!-- Disqus Comments -->
<!-- 
<script type="text/javascript">
    var disqus_shortname = 'rogerluo';

    (function(){
        var dsq = document.createElement('script');
        dsq.type = 'text/javascript';
        dsq.async = true;
        dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
        (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    }());
</script>
 -->

<!-- MathJax -->
<script type="text/x-mathjax-config">
    MathJax.Hub.Config({
        tex2jax: {
          inlineMath: [ ['$','$'], ["\\(","\\)"] ],
          displayMath: [ ['$$', '$$'], ["\\[", "\\]"] ],
          processEscapes: true
        },
        TeX: {
          equationNumbers: {
            autoNumber: 'AMS'
          }
        },
        "HTML-CSS": {
          imageFont: null
        }
      });
</script>

<script type="text/javascript" src="http://cdn.mathjax.org/mathjax/2.1-latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>

<div id="totop" style="position:fixed;bottom:20px;right:50px;cursor: pointer;">
    <span class="fa-stack fa-lg">
        <i class="fa fa-arrow-circle-up fa-stack-2x"></i>
    </span>
</div>


<script src="/js/totop.js"></script>


</body>

</html>