<!DOCTYPE html>
<html lang="en">

<!-- Head tag -->
<head>

    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">

    <!--Description-->
    
        <meta name="description" content="Not every post is provided with an English version (eg. novels)">
    

    <!--Author-->
    
        <meta name="author" content="Roger Luo">
    

    <!--Open Graph Title-->
    
        <meta property="og:title" content="novel|Chapter IV"/>
    

    <!--Open Graph Description-->
    
        <meta property="og:description" content="Not every post is provided with an English version (eg. novels)" />
    

    <!--Open Graph Site Name-->
    <meta property="og:site_name" content="Half Integer"/>

    <!--Type page-->
    
        <meta property="og:type" content="article" />
    

    <!--Page Cover-->
    

        <meta name="twitter:card" content="summary" />
    

    <!-- Title -->
    
    <title>novel|Chapter IV - Half Integer</title>

    <!-- Bootstrap Core CSS -->
    <link href="//maxcdn.bootstrapcdn.com/bootstrap/3.3.6/css/bootstrap.min.css" rel="stylesheet"/>

    <!-- Custom CSS -->
    <link rel="stylesheet" href="/css/style.css">

    <!-- Custom Fonts -->
    <link href="//maxcdn.bootstrapcdn.com/font-awesome/4.6.3/css/font-awesome.min.css" rel="stylesheet" type="text/css">
    <link href="//fonts.googleapis.com/css?family=Lora:400,700,400italic,700italic" rel="stylesheet" type="text/css">
    <link href="//fonts.googleapis.com/css?family=Open+Sans:300italic,400italic,600italic,700italic,800italic,400,300,600,700,800" rel="stylesheet" type="text/css">

    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
    <script src="//oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
    <script src="//oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->

    <!-- Gallery -->
    <link href="//cdnjs.cloudflare.com/ajax/libs/featherlight/1.3.5/featherlight.min.css" type="text/css" rel="stylesheet" />

    <!-- Google Analytics -->
    


</head>


<body>

    <!-- Menu -->
    <!-- Navigation -->
<nav class="navbar navbar-default navbar-custom navbar-fixed-top">
    <div class="container-fluid">
        <!-- Brand and toggle get grouped for better mobile display -->
        <div class="navbar-header page-scroll">
            <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="/">Half Integer</a>
        </div>

        <!-- Collect the nav links, forms, and other content for toggling -->
        <div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
            <ul class="nav navbar-nav navbar-right">
                
                    <li>
                        <a href="https://Roger-luo.github.io/en/">
                            
                                English
                            
                        </a>
                    </li>
                
                    <li>
                        <a href="/">
                            
                                主页
                            
                        </a>
                    </li>
                
                    <li>
                        <a href="/cv">
                            
                                CV
                            
                        </a>
                    </li>
                
                    <li>
                        <a href="/codes">
                            
                                代码
                            
                        </a>
                    </li>
                
                    <li>
                        <a href="https://Roger-luo.github.io/slides/">
                            
                                幻灯片
                            
                        </a>
                    </li>
                
                    <li>
                        <a href="/archives">
                            
                                文档
                            
                        </a>
                    </li>
                
                    <li>
                        <a href="https://github.com/Roger-luo/Roger-luo.github.io">
                            
                                <i class="fa fa-github fa-stack-2x"></i>
                            
                        </a>
                    </li>
                
            </ul>
        </div>
        <!-- /.navbar-collapse -->
    </div>
    <!-- /.container -->
</nav>

    <!-- Main Content -->
    <!-- Page Header -->
<!-- Set your background image for this header in your post front-matter: cover -->

<header class="post-header" style="background-image: url('/img/home-bg-2.jpg')">
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <div class="post-heading">
                    <h1>novel|Chapter IV</h1>
                    
                    <span class="meta">
                        <!-- Date and Author -->
                        
                        2016-01-08
                    </span>
                </div>
            </div>
        </div>
    </div>
</header>

<!-- Post Content -->
<article>
    <div class="container">
        <div class="row">

            <!-- Tags and categories -->
           
                <div class="col-lg-4 col-lg-offset-2 col-md-5 col-md-offset-1 post-tags">
                    
                        


<a href="/tags/novel/">#novel</a>


                    
                </div>
                <div class="col-lg-4 col-md-5 post-categories">
                    
                </div>
            

            <!-- Gallery -->
            

            <!-- Post Main Content -->
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <h2 id="nan-min">&#x96BE;&#x6C11; <a href="#nan-min" class="header-anchor">#</a></h2>
<p>&#x8FD9;&#x4E00;&#x5929;&#x7684;&#x6E05;&#x6668;&#xFF0C;&#x5927;&#x96FE;&#x56DB;&#x8D77;&#xFF0C;&#x897F;&#x65B9;&#x7684;&#x6208;&#x58C1;&#x4E0A;&#x7A00;&#x7A00;&#x4E24;&#x4E24;&#x5730;&#x957F;&#x7740;&#x68AD;&#x68AD;&#xFF0C;&#x5728;&#x96FE;&#x91CC;&#x770B;&#x8D77;&#x6765;&#x597D;&#x4F3C;&#x4ECE;&#x5730;&#x72F1;&#x4F38;&#x51FA;&#x7684;&#x9B3C;&#x624B;&#x3002;&#x8D6B;&#x77F3;&#x57CE;&#x4E00;&#x7247;&#x5B89;&#x9759;&#xFF0C;&#x4EBA;&#x4EEC;&#x8FD8;&#x5728;&#x719F;&#x7761;&#xFF0C;&#x5B88;&#x536B;&#x57CE;&#x95E8;&#x7684;&#x536B;&#x5175;&#x4EEC;&#x7AD9;&#x4E86;&#x5927;&#x534A;&#x591C;&#x6253;&#x7740;&#x54C6;&#x55E6;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4F1A;&#x513F;&#x5C31;&#x80FD;&#x6362;&#x5C97;&#x4E86;&#x3002;</p>
<p>&#x201C;&#x4EC0;&#x4E48;&#x4EBA;&#xFF01;&#x201D;&#x4E00;&#x4E2A;&#x58EB;&#x5175;&#x770B;&#x5230;&#x8FDC;&#x5904;&#x7684;&#x6D53;&#x96FE;&#x91CC;&#x4F9D;&#x7A00;&#x6709;&#x4E00;&#x4E2A;&#x9ED1;&#x5F71;&#x3002;</p>
<p>&#x201C;&#x554A;&#xFF01;&#xFF01;&#xFF01;&#x201D;</p>
<p>&#x8FDC;&#x5904;&#x4F20;&#x6765;&#x6495;&#x5FC3;&#x88C2;&#x80BA;&#x7684;&#x543C;&#x53EB;&#xFF0C;&#x6B64;&#x8D77;&#x5F7C;&#x4F0F;&#xFF0C;&#x9ED1;&#x5F71;&#x5F80;&#x8FDC;&#x5904;&#x9003;&#x53BB;&#x3002;</p>
<p>&#x536B;&#x5175;&#x987F;&#x65F6;&#x6253;&#x8D77;&#x4E86;&#x7CBE;&#x795E;&#xFF0C;&#x4E24;&#x4E2A;&#x536B;&#x5175;&#x51B2;&#x4E86;&#x8FC7;&#x53BB;&#x3002;&#x8BAD;&#x7EC3;&#x6709;&#x7D20;&#x7684;&#x536B;&#x5175;&#x8FC5;&#x901F;&#x8FFD;&#x5230;&#x4E86;&#x8FD9;&#x4E2A;&#x9ED1;&#x5F71;&#x3002;&#x8FD1;&#x4E00;&#x770B;&#xFF0C;&#x7537;&#x5973;&#x8001;&#x5C11;&#x9ED1;&#x538B;&#x538B;&#x7684;&#x4E00;&#x7247;&#xFF0C;&#x8863;&#x886B;&#x6F9C;&#x7F15;&#xFF0C;&#x6D51;&#x8EAB;&#x810F;&#x516E;&#x516E;&#x90FD;&#x662F;&#x9ED1;&#x8272;&#x7684;&#x6C61;&#x57A2;&#x3002;&#x770B;&#x8D77;&#x6765;&#x90FD;&#x597D;&#x50CF;&#x5FEB;&#x8981;&#x51BB;&#x6B7B;&#x4E86;&#xFF0C;&#x745F;&#x7F29;&#x5730;&#x6324;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x5927;&#x4EBA;&#x773C;&#x795E;&#x7A7A;&#x6D1E;&#xFF0C;&#x9762;&#x5BB9;&#x67AF;&#x7626;&#xFF0C;&#x5A74;&#x5B69;&#x4E0D;&#x54ED;&#x4E0D;&#x95F9;&#xFF0C;&#x4E0D;&#x77E5;&#x662F;&#x6CA1;&#x529B;&#x6C14;&#xFF0C;&#x8FD8;&#x662F;&#x65E9;&#x5DF2;&#x51BB;&#x6B7B;&#x3002;</p>
<p>&#x201C;&#x5B98;&#x7237;&#x60A8;&#x884C;&#x884C;&#x597D;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x53BB;&#x4E2D;&#x539F;&#x8C0B;&#x6761;&#x751F;&#x8DEF;&#x5427;&#x3002;&#x6211;&#x4EEC;&#x4E00;&#x8DEF;&#x8D70;&#x6765;&#x6B7B;&#x4E86;&#x5F88;&#x591A;&#x4EBA;&#x4E86;&#xFF0C;&#x897F;&#x8FB9;&#x6765;&#x4E86;&#x9B54;&#x9B3C;&#x554A;&#xFF0C;&#x6211;&#x4EEC;&#x771F;&#x7684;&#x6D3B;&#x4E0D;&#x4E0B;&#x53BB;&#x4E86;&#x554A;&#xFF01;&#x201D;&#x4E00;&#x4E2A;&#x4E2D;&#x5E74;&#x7537;&#x5B50;&#x5411;&#x536B;&#x5175;&#x78D5;&#x5934;&#xFF0C;&#x8EAB;&#x4E0A;&#x5DF2;&#x7ECF;&#x7834;&#x7834;&#x70C2;&#x70C2;&#xFF0C;&#x788E;&#x5E03;&#x6CBE;&#x7740;&#x8840;&#x6E0D;&#x3002;</p>
<p>&#x201C;&#x4EC0;&#x4E48;&#x9B54;&#x9B3C;&#xFF1F;&#x5509;&#xFF0C;&#x4F60;&#x4EEC;&#x5148;&#x5728;&#x57CE;&#x95E8;&#x5916;&#x7B49;&#x7740;&#xFF0C;&#x6211;&#x4EEC;&#x5F97;&#x8981;&#x56DE;&#x53BB;&#x7980;&#x62A5;&#x3002;&#x201D;</p>
<p>&#x5185;&#x57CE;&#xFF0C;&#x57CE;&#x4E3B;&#x8FD8;&#x5728;&#x7761;&#x68A6;&#x4E4B;&#x4E2D;&#xFF0C;&#x5306;&#x5306;&#x88AB;&#x4EBA;&#x558A;&#x9192;&#xFF0C;&#x5728;&#x5916;&#x9762;&#x6572;&#x95E8;&#x7684;&#x662F;&#x8D6B;&#x77F3;&#x57CE;&#x7684;&#x5E08;&#x7237;&#xFF0C;&#x8BF4;&#x662F;&#x57CE;&#x897F;&#x6709;&#x6570;&#x4E07;&#x96BE;&#x6C11;&#x90FD;&#x5728;&#x95E8;&#x5916;&#x3002;&#x7F57;&#x65E5;&#x65B0;&#x5306;&#x5FD9;&#x7A7F;&#x8D77;&#x8863;&#x670D;&#x6765;&#x5230;&#x57CE;&#x5916;&#x3002;&#x6C14;&#x6E29;&#x5F88;&#x4F4E;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x96FE;&#x6C14;&#x4E2D;&#x96F6;&#x96F6;&#x661F;&#x661F;&#x5730;&#x98D8;&#x7740;&#x4E00;&#x4E9B;&#x96EA;&#x82B1;&#xFF0C;&#x8FD9;&#x9ED1;&#x538B;&#x538B;&#x7684;&#x96BE;&#x6C11;&#x671B;&#x90FD;&#x671B;&#x4E0D;&#x5230;&#x5C3D;&#x5934;&#xFF0C;&#x6574;&#x4E2A;&#x897F;&#x95E8;&#x5916;&#x653E;&#x773C;&#x671B;&#x53BB;&#x5168;&#x662F;&#x810F;&#x516E;&#x516E;&#x7684;&#x96BE;&#x6C11;&#x3002;&#x80AF;&#x5B9A;&#x4E0D;&#x80FD;&#x8BA9;&#x4ED6;&#x4EEC;&#x7559;&#x5728;&#x57CE;&#x5185;&#xFF0C;&#x5426;&#x5219;&#x8D6B;&#x77F3;&#x57CE;&#x662F;&#x517B;&#x4E0D;&#x8D77;&#x7684;&#x3002;</p>
<p>&#x201C;&#x4F20;&#x4EE4;&#xFF01;&#x7CAE;&#x4ED3;&#x7684;&#x7CAE;&#x98DF;&#x7559;&#x4E00;&#x534A;&#xFF0C;&#x5269;&#x4E0B;&#x7684;&#x7ED9;&#x4ED6;&#x4EEC;&#x505A;&#x4E9B;&#x7CA5;&#x3002;&#x201D;&#x7F57;&#x65E5;&#x65B0;&#x770B;&#x5230;&#x57CE;&#x4E0B;&#x7684;&#x8FD9;&#x4E9B;&#x96BE;&#x6C11;&#x4E5F;&#x4E0D;&#x5FCD;&#x4ED6;&#x4EEC;&#x6328;&#x997F;&#x53D7;&#x51BB;&#x3002;</p>
<p>&#x201C;&#x57CE;&#x4E3B;&#xFF0C;&#x6211;&#x8BA9;&#x897F;&#x95E8;&#x7684;&#x58EB;&#x5175;&#x8BE2;&#x95EE;&#x4E86;&#x4E00;&#x4E9B;&#x96BE;&#x6C11;&#x4ED6;&#x4EEC;&#x4ECE;&#x4F55;&#x5904;&#x6765;&#xFF0C;&#x53C8;&#x662F;&#x4E3A;&#x4F55;&#x9003;&#x96BE;&#x3002;&#x201D;&#x5E08;&#x7237;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x51C6;&#x5907;&#x5411;&#x57CE;&#x4E3B;&#x62A5;&#x544A;&#x4E00;&#x4E0B;&#x60C5;&#x51B5;&#xFF0C;&#x6E05;&#x6668;&#x5F88;&#x51B7;&#xFF0C;&#x5E08;&#x7237;&#x745F;&#x7F29;&#x5728;&#x4ED6;&#x7684;&#x5927;&#x68C9;&#x8884;&#x91CC;&#x3002;</p>
<p>&#x201C;&#x54E6;&#xFF0C;&#x5FEB;&#x8BF4;&#x6765;&#x542C;&#x542C;&#xFF1F;&#x201D;</p>
<p>&#x201C;&#x989D;&#xFF0C;&#x5927;&#x4EBA;&#x554A;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x8FD9;&#x4E9B;&#x8BDD;&#x53EF;&#x80FD;&#x542C;&#x8D77;&#x6765;&#x50CF;&#x795E;&#x8BDD;&#x6545;&#x4E8B;&#xFF0C;&#x4F46;&#x662F;&#x786E;&#x5B9E;&#x662F;&#x4ECE;&#x4E0B;&#x9762;&#x7684;&#x96BE;&#x6C11;&#x53E3;&#x4E2D;&#x95EE;&#x5230;&#x7684;&#x3002;&#x8FD9;&#x4E9B;&#x4EBA;&#x90FD;&#x662F;&#x5927;&#x79E6;&#x7684;&#x5B50;&#x6C11;&#xFF0C;&#x636E;&#x4ED6;&#x4EEC;&#x8BF4;&#x5927;&#x79E6;&#x88AB;&#x602A;&#x7269;&#x7ED9;&#x706D;&#x4E86;&#xFF01;&#x201D;</p>
<p>&#x201C;&#x602A;&#x7269;&#xFF1F;&#x201D;&#x7F57;&#x65E5;&#x65B0;&#x76B1;&#x8D77;&#x7709;&#x5934;&#x9732;&#x51FA;&#x4E0D;&#x89E3;&#x7684;&#x8868;&#x60C5;&#xFF0C;&#x201C;&#x7EE7;&#x7EED;&#x8BF4;&#x3002;&#x201D;</p>
<p>&#x201C;&#x8FD9;&#x4E9B;&#x4EBA;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x662F;&#x5927;&#x79E6;&#x4E1C;&#x9762;&#x51E0;&#x4E2A;&#x57CE;&#x9547;&#x9003;&#x8FC7;&#x6765;&#x7684;&#xFF0C;&#x8BF4;&#x662F;&#x5927;&#x7EA6;&#x4E24;&#x4E2A;&#x6708;&#x524D;&#xFF0C;&#x5927;&#x79E6;&#x897F;&#x9762;&#x7684;&#x9996;&#x90FD;&#x5723;&#x7EA6;&#x7FF0;&#x57CE;&#x5C31;&#x88AB;&#x653B;&#x7834;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x6CA1;&#x591A;&#x4E45;&#x5927;&#x79E6;&#x6700;&#x4E1C;&#x9762;&#x7684;&#x701A;&#x5CAD;&#x5C31;&#x6765;&#x4E86;&#x4E00;&#x76F4;&#x4EBA;&#x5F62;&#x7684;&#x602A;&#x7269;&#x519B;&#x56E2;&#xFF0C;&#x8EAB;&#x62AB;&#x91CD;&#x7532;&#xFF0C;&#x57CE;&#x4E0A;&#x7684;&#x91CD;&#x5F29;&#x90FD;&#x5C04;&#x4E0D;&#x7834;&#x8FD9;&#x94E0;&#x7532;&#xFF0C;&#x8DD1;&#x8D77;&#x6765;&#x548C;&#x8F7B;&#x9A91;&#x5175;&#x4E00;&#x6837;&#x5FEB;&#xFF0C;&#x4E00;&#x8DC3;&#x6709;&#x6570;&#x7C73;&#x4E4B;&#x9AD8;&#x3002;&#x8FD8;&#x6709;&#x5927;&#x8759;&#x8760;&#xFF0C;&#x76AE;&#x7CD9;&#x8089;&#x539A;&#xFF0C;&#x7FFC;&#x5C55;&#x80FD;&#x6709;&#x4E09;&#x56DB;&#x7C73;&#xFF0C;&#x4E00;&#x4E0A;&#x6765;&#x5C31;&#x628A;&#x57CE;&#x5899;&#x4E0A;&#x7684;&#x5B88;&#x519B;&#x6740;&#x4E86;&#x4E03;&#x4E03;&#x516B;&#x516B;&#x3002;&#x5C3D;&#x7BA1;&#x701A;&#x5CAD;&#x6709;&#x7740;&#x5C45;&#x9AD8;&#x4E34;&#x4E0B;&#x7684;&#x5730;&#x5F62;&#xFF0C;&#x4E5F;&#x5C31;&#x9760;&#x7740;&#x57CE;&#x4E0A;&#x7684;&#x706B;&#x6CB9;&#x6491;&#x4E86;&#x4E00;&#x5929;&#x5C31;&#x88AB;&#x7834;&#x4E86;&#x57CE;&#x95E8;&#x3002;&#x5176;&#x5B83;&#x51E0;&#x4E2A;&#x57CE;&#x9003;&#x8FC7;&#x6765;&#x7684;&#x57FA;&#x672C;&#x4E5F;&#x90FD;&#x662F;&#x8FD9;&#x4E2A;&#x60C5;&#x51B5;&#xFF0C;&#x9B54;&#x9B3C;&#x5927;&#x519B;&#x4E00;&#x8FDB;&#x57CE;&#x5C31;&#x662F;&#x75AF;&#x72C2;&#x5730;&#x5C60;&#x622E;&#x554A;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EBA;&#x9003;&#x96BE;&#x7684;&#x8DEF;&#x4E0A;&#x5C31;&#x88AB;&#x6740;&#x4E86;&#x4E0D;&#x77E5;&#x591A;&#x5C11;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x7A7F;&#x8FC7;&#x8FD9;&#x832B;&#x832B;&#x9694;&#x58C1;&#x8BF4;&#x662F;&#x5DF2;&#x7ECF;&#x6B7B;&#x4E86;&#x4E00;&#x5927;&#x534A;&#x5566;&#xFF0C;&#x8FD9;&#x8DEF;&#x4E0A;&#x5B9E;&#x5728;&#x997F;&#x5F97;&#x4E0D;&#x884C;&#x5C31;&#x9760;&#x5403;&#x6B7B;&#x4EBA;&#x8089;&#x8FD9;&#x4E48;&#x8FC7;&#x6765;&#x3002;&#x5927;&#x79E6;&#x51E0;&#x5341;&#x4E07;&#x5B50;&#x6C11;&#x5C31;&#x5269;&#x8FD9;&#x6570;&#x4E07;&#x4EBA;&#x4E86;&#x3002;&#x201D;</p>
<p>&#x201C;&#x5E08;&#x7237;&#xFF0C;&#x4F60;&#x600E;&#x4E48;&#x770B;&#xFF1F;&#x201D;&#x57CE;&#x4E3B;&#x542C;&#x5230;&#x8FD9;&#x4E48;&#x79BB;&#x5947;&#x7684;&#x6545;&#x4E8B;&#x4E5F;&#x6709;&#x4E9B;&#x4E0D;&#x77E5;&#x5982;&#x4F55;&#x5E94;&#x5BF9;&#x4E86;&#x3002;&#x8FD9;&#x5E08;&#x7237;&#x4E5F;&#x662F;&#x897F;&#x5317;&#x9876;&#x9876;&#x6709;&#x540D;&#x7684;&#x795E;&#x7B97;&#x5B50;&#xFF0C;&#x5341;&#x5E74;&#x524D;&#x5728;&#x4E2D;&#x539F;&#x8BF8;&#x56FD;&#x7EB7;&#x4E89;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5728;&#x5DEB;&#x9547;&#x4EE5;&#x4E00;&#x4E07;&#x7CBE;&#x5175;&#x51FB;&#x9000;&#x71D5;&#x56FD;&#x5341;&#x4E07;&#x96C4;&#x5E08;&#xFF0C;&#x5F53;&#x65F6;&#x5175;&#x529B;&#x6700;&#x5F3A;&#x7684;&#x71D5;&#x56FD;&#x5927;&#x4F24;&#x5143;&#x6C14;&#xFF0C;&#x9020;&#x5C31;&#x4E86;&#x73B0;&#x5728;&#x8FD9;&#x8BF8;&#x4FAF;&#x4E92;&#x76F8;&#x5236;&#x8861;&#x7684;&#x5C40;&#x9762;&#x3002;</p>
<p>&#x201C;&#x4F9D;&#x6211;&#x4E4B;&#x89C1;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x4ECE;&#x8FD9;&#x4E9B;&#x96BE;&#x6C11;&#x91CC;&#x5F81;&#x62DB;&#x4E00;&#x6279;&#x5E74;&#x8F7B;&#x529B;&#x58EE;&#x8865;&#x5145;&#x519B;&#x529B;&#xFF0C;&#x7136;&#x540E;&#x5269;&#x4E0B;&#x7684;&#x8BA9;&#x4ED6;&#x4EEC;&#x5F80;&#x4E2D;&#x539F;&#x8D70;&#x3002;&#x5C40;&#x52BF;&#x5982;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x5F97;&#x4E0D;&#x9632;&#x3002;&#x8BB2;&#x9053;&#x7406;&#x7684;&#x8BDD;&#xFF0C;&#x8FD9;&#x4EF6;&#x4E8B;&#x8981;&#x89E3;&#x91CA;&#x4E5F;&#x53EA;&#x80FD;&#x548C;&#x51B0;&#x5C01;&#x4E4B;&#x6D77;&#x7684;&#x4F20;&#x8BF4;&#x8054;&#x7CFB;&#x8D77;&#x6765;&#x4E86;&#x201D;</p>
<p>&#x201C;&#x6069;&#xFF0C;&#x6211;&#x4E5F;&#x662F;&#x8FD9;&#x4E48;&#x60F3;&#x7684;&#x3002;&#x867D;&#x8BF4;&#x6B64;&#x4E8B;&#x79BB;&#x5947;&#xFF0C;&#x4F46;&#x8FD9;&#x51E0;&#x4E07;&#x96BE;&#x6C11;&#x5374;&#x662F;&#x4E8B;&#x5B9E;&#x3002;&#x4E5F;&#x53EA;&#x6709;&#x51B0;&#x5C01;&#x4E4B;&#x6D77;&#x7684;&#x4F20;&#x8BF4;&#x6682;&#x65F6;&#x80FD;&#x89E3;&#x91CA;&#x8FD9;&#x4EF6;&#x4E8B;&#x4E86;&#x3002;&#x82E5;&#x771F;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x6050;&#x6015;&#x6211;&#x4EEC;&#x8981;&#x505A;&#x597D;&#x5145;&#x5206;&#x7684;&#x51C6;&#x5907;&#x554A;&#x3002;&#x5C31;&#x6309;&#x4F60;&#x8BF4;&#x7684;&#x529E;&#xFF0C;&#x62DB;&#x5175;&#xFF0C;&#x5269;&#x4E0B;&#x7684;&#x653E;&#x884C;&#xFF0C;&#x8BA9;&#x4ED6;&#x4EEC;&#x5F80;&#x4E2D;&#x539F;&#x8D70;&#x5427;&#xFF0C;&#x7136;&#x540E;&#x5411;&#x4E2D;&#x539F;&#x8BF8;&#x56FD;&#x4F20;&#x4FE1;&#xFF0C;&#x8BF4;&#x5927;&#x79E6;&#x88AB;&#x897F;&#x6D77;&#x4E4B;&#x9B54;&#x706D;&#x56FD;&#x4E86;&#xFF0C;&#x80FD;&#x591F;&#x652F;&#x63F4;&#x6211;&#x4EEC;&#x505A;&#x597D;&#x9632;&#x5B88;&#xFF0C;&#x5982;&#x679C;&#x897F;&#x9762;&#x7684;&#x4E1C;&#x897F;&#x6253;&#x8FC7;&#x6765;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x662F;&#x4E2D;&#x539F;&#x7684;&#x7B2C;&#x4E00;&#x9053;&#x9632;&#x7EBF;&#xFF0C;&#x4E5F;&#x662F;&#x6700;&#x597D;&#x5B88;&#x7684;&#x9632;&#x7EBF;&#xFF0C;&#x5426;&#x5219;&#x88AB;&#x706D;&#x56FD;&#x7684;&#x5C31;&#x4E0D;&#x53EA;&#x5927;&#x79E6;&#x4E86;&#x3002;&#x9A6C;&#x4E0A;&#x53EC;&#x96C6;&#x6240;&#x6709;&#x5BB6;&#x81E3;&#x3002;&#x201D;&#x4F46;&#x662F;&#x7F57;&#x65E5;&#x65B0;&#x5FC3;&#x91CC;&#x4E5F;&#x6E05;&#x695A;&#xFF0C;&#x82E5;&#x5927;&#x79E6;&#x88AB;&#x706D;&#x56FD;&#x4E4B;&#x4E8B;&#x5C5E;&#x5B9E;&#xFF0C;&#x8D6B;&#x77F3;&#x57CE;&#x4E5F;&#x4E0D;&#x89C1;&#x5F97;&#x80FD;&#x6491;&#x591A;&#x4E45;&#x3002;&#x90A3;&#x53EF;&#x662F;&#x6709;&#x7740;&#x5341;&#x4E07;&#x7CBE;&#x5175;&#xFF0C;&#x80FD;&#x5DE5;&#x5DE7;&#x5320;&#x65E0;&#x6570;&#xFF0C;&#x8BF4;&#x706D;&#x5C31;&#x706D;&#x4E86;&#x3002;&#x5982;&#x6B64;&#x5F3A;&#x608D;&#x529B;&#x91CF;&#xFF0C;&#x4E5F;&#x53EA;&#x80FD;&#x7528;&#x9B54;&#x9B3C;&#x5F62;&#x5BB9;&#x4E86;&#x3002;&#x5C0F;&#x5C0F;&#x8D6B;&#x77F3;&#x548C;&#x547D;&#x8FD0;&#x53C8;&#x4F1A;&#x662F;&#x5982;&#x4F55;&#x5462;&#xFF1F;&#x53EF;&#x662F;&#x5927;&#x6218;&#x5C06;&#x81F3;&#xFF0C;&#x5207;&#x4E0D;&#x53EF;&#x4E71;&#x4E86;&#x519B;&#x5FC3;&#x3002;</p>
<p>&#x8BAE;&#x4E8B;&#x5385;&#x91CC;&#xFF0C;&#x7089;&#x706B;&#x5DF2;&#x7ECF;&#x88AB;&#x70B9;&#x4E86;&#x8D77;&#x6765;&#xFF0C;&#x660F;&#x9EC4;&#x7684;&#x706F;&#x5149;&#x6253;&#x4EAE;&#x4E86;&#x5899;&#x58C1;&#x4E0A;&#x6302;&#x7740;&#x7684;&#x5386;&#x4EE3;&#x7F57;&#x6C0F;&#x57CE;&#x4E3B;&#x7684;&#x753B;&#x50CF;&#xFF0C;&#x663E;&#x5F97;&#x5A01;&#x4E25;&#x800C;&#x795E;&#x5723;&#x3002;&#x4F46;&#x7A7A;&#x6C14;&#x8FD8;&#x662F;&#x51B0;&#x51C9;&#x7684;&#xFF0C;&#x8D6B;&#x77F3;&#x57CE;&#x7684;&#x5BB6;&#x81E3;&#x4EEC;&#x5374;&#x5DF2;&#x7ECF;&#x5404;&#x81EA;&#x5750;&#x4E0B;&#x4E86;&#x3002;</p>
<p>&#x201C;&#x5404;&#x4F4D;&#xFF0C;&#x60F3;&#x5FC5;&#x5927;&#x79E6;&#x706D;&#x56FD;&#x7684;&#x4E8B;&#x60C5;&#x5DF2;&#x7ECF;&#x542C;&#x8BF4;&#x4E86;&#x5427;&#x3002;&#x201D;</p>
<p>&#x201C;&#x57CE;&#x4E3B;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x5411;&#x8BF8;&#x4FAF;&#x6C42;&#x63F4;&#x4E00;&#x4E8B;&#x4E0D;&#x59A5;&#x3002;&#x201D;&#x4E00;&#x4E2A;&#x5927;&#x80E1;&#x5B50;&#x8001;&#x5934;&#x6700;&#x5148;&#x53D1;&#x8A00;&#x4E86;&#x3002;&#x201C;&#x4E2D;&#x539F;&#x8BF8;&#x56FD;&#x4E92;&#x76F8;&#x5236;&#x8861;&#xFF0C;&#x6BCF;&#x4E2A;&#x56FD;&#x5BB6;&#x90FD;&#x60F3;&#x5360;&#x9886;&#x8FD9;&#x4EA4;&#x901A;&#x8981;&#x5730;&#x3002;&#x8D6B;&#x77F3;&#x57CE;&#x6C42;&#x63F4;&#xFF0C;&#x65E0;&#x5F02;&#x4E8E;&#x6253;&#x5F00;&#x57CE;&#x95E8;&#x8BA9;&#x4ED6;&#x56FD;&#x519B;&#x961F;&#x5360;&#x9886;&#xFF0C;&#x53EA;&#x8981;&#x65F6;&#x673A;&#x5408;&#x9002;&#xFF0C;&#x5C31;&#x53EF;&#x91CC;&#x5E94;&#x5916;&#x5408;&#x4E00;&#x4E3E;&#x653B;&#x4E0B;&#x8D6B;&#x77F3;&#xFF01;&#x6240;&#x4EE5;&#x4EE5;&#x8FD9;&#x4E9B;&#x8BF8;&#x4FAF;&#x7684;&#x60EF;&#x7528;&#x624B;&#x6BB5;&#xFF0C;&#x4ED6;&#x4EEC;&#x6D3E;&#x6765;&#x63F4;&#x52A9;&#x7684;&#x519B;&#x961F;&#x8981;&#x4E48;&#x4E0D;&#x4F1A;&#x4F5C;&#x6218;&#x4FDD;&#x5B58;&#x5B9E;&#x529B;&#xFF0C;&#x8981;&#x4E48;&#x5C31;&#x90FD;&#x4E0D;&#x4F1A;&#x6D3E;&#x519B;&#x961F;&#x6765;&#x652F;&#x63F4;&#x3002;&#x540E;&#x8005;&#x8FD8;&#x597D;&#xFF0C;&#x82E5;&#x662F;&#x524D;&#x8005;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x4F1A;&#x5904;&#x5904;&#x88AB;&#x52A8;&#x4E86;&#x3002;&#x201D;</p>
<p>&#x201C;&#x4F46;&#x662F;&#xFF0C;&#x504C;&#x5927;&#x7684;&#x5927;&#x79E6;&#x90FD;&#x4E0D;&#x80FD;&#x62B5;&#x5FA1;&#x8FD9;&#x9B54;&#x9B3C;&#x5927;&#x519B;&#xFF0C;&#x4F55;&#x51B5;&#x6211;&#x5C0F;&#x5C0F;&#x8D6B;&#x77F3;&#xFF0C;&#x5C3D;&#x7BA1;&#x6211;&#x4EEC;&#x6709;&#x6208;&#x58C1;&#x4F5C;&#x4E3A;&#x5C4F;&#x969C;&#xFF0C;&#x4F46;&#x53C8;&#x5982;&#x4F55;&#x80FD;&#x62B5;&#x5FA1;&#x4E00;&#x8DC3;&#x6570;&#x7C73;&#x7684;&#x9B54;&#x9B3C;&#x58EB;&#x5175;&#xFF1F;&#x201D;</p>
<p><a href="/2016/01/08/2015-12-20-novel/">&#x56DE;&#x5230;&#x76EE;&#x5F55;</a></p>


                
            </div>

            <!-- Comments -->
            
                <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                    


  <section id="comments">
    <!-- 多说评论框 start -->
    <div class="ds-thread" data-thread-key="post-novel-chapter-4" data-title="novel|Chapter IV" data-url="http://Roger-luo.github.com/2016/01/08/novel-chapter-4/"></div>
    <!-- 多说评论框 end -->
    <!-- 多说公共JS代码 start (一个网页只需插入一次) -->
    <script type="text/javascript">
    var duoshuoQuery = {short_name:'rogerluo'};
      (function() {
        var ds = document.createElement('script');
        ds.type = 'text/javascript';ds.async = true;
        ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
        ds.charset = 'UTF-8';
        (document.getElementsByTagName('head')[0] 
         || document.getElementsByTagName('body')[0]).appendChild(ds);
        })();
            </script>
        <!-- 多说公共JS代码 end -->
    </section>

                </div>
            
        </div>
    </div>
</article>


    <!-- Footer -->
    <hr />

<!-- Footer -->
<footer>
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <ul class="list-inline text-center">
                    

                    

                    
                        <li>
                            <a href="https://github.com/Roger-luo" target="_blank">
                                <span class="fa-stack fa-lg">
                                    <i class="fa fa-circle fa-stack-2x"></i>
                                    <i class="fa fa-github fa-stack-1x fa-inverse"></i>
                                </span>
                            </a>
                        </li>
                    

                    
                        <li>
                            <a onclick="alert('Email me to get my wechat XD ')" target="_blank">
                                <span class="fa-stack fa-lg">
                                    <i class="fa fa-circle fa-stack-2x"></i>
                                    <i class="fa fa-wechat fa-stack-1x fa-inverse"></i>
                                </span>
                            </a>
                        </li>
                    

                    

                    
                        <li>
                            <a href="mailto:hiroger@qq.com" target="_blank">
                                <span class="fa-stack fa-lg">
                                    <i class="fa fa-circle fa-stack-2x"></i>
                                    <i class="fa fa-envelope-o fa-stack-1x fa-inverse"></i>
                                </span>
                            </a>
                        </li>
                    

                    
                </ul>
                
                <div class="copyright text-muted">
                    <div class="panel-heading">
                        <h4 class="panel-title">
                            <a data-toggle="collapse" data-parent="#accordion" href="#collapseOne">
                                Click to see Roger Luo's friends :-)
                            </a>
                        </h4>
                    </div>
                <div id="collapseOne" class="panel-collapse collapse">
                
                <p class="copyright text-muted" style="margin-top: 7px">
                <a target="_blank" href="http://crduan.cc">Chenru Duan</a>
                </p>
                
                <p class="copyright text-muted" style="margin-top: 7px">
                <a target="_blank" href="http://chenjunwang.com">Chenjun Wang</a>
                </p>
                
                </div>
                </div>

                
            </div>
        </div>
    </div>
</footer>


    <!-- After footer scripts -->
    
<!-- jQuery -->
<script src="//code.jquery.com/jquery-2.1.4.min.js"></script>

<!-- Bootstrap -->
<script src="//maxcdn.bootstrapcdn.com/bootstrap/3.3.6/js/bootstrap.min.js"></script>

<!-- Gallery -->
<script src="//cdnjs.cloudflare.com/ajax/libs/featherlight/1.3.5/featherlight.min.js" type="text/javascript" charset="utf-8"></script>

<!-- Waypoint -->
<script src="//cdnjs.cloudflare.com/ajax/libs/waypoints/4.0.1/noframework.waypoints.min.js" type="text/javascript" charset="utf-8"></script>

<!-- Disqus Comments -->
<!-- 
<script type="text/javascript">
    var disqus_shortname = 'rogerluo';

    (function(){
        var dsq = document.createElement('script');
        dsq.type = 'text/javascript';
        dsq.async = true;
        dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
        (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    }());
</script>
 -->

<!-- MathJax -->
<script type="text/x-mathjax-config">
    MathJax.Hub.Config({
        tex2jax: {
          inlineMath: [ ['$','$'], ["\\(","\\)"] ],
          displayMath: [ ['$$', '$$'], ["\\[", "\\]"] ],
          processEscapes: true
        },
        TeX: {
          equationNumbers: {
            autoNumber: 'AMS'
          }
        },
        "HTML-CSS": {
          imageFont: null
        }
      });
</script>

<script type="text/javascript" src="http://cdn.mathjax.org/mathjax/2.1-latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>

<div id="totop" style="position:fixed;bottom:150px;right:50px;cursor: pointer;">
    <span class="fa-stack fa-lg">
        <i class="fa fa-circle fa-stack-2x"></i>
        <i class="fa fa-arrow-up fa-stack-1x fa-inverse"></i>
    </span>
</div>


<script src="/js/totop.js"></script>


</body>

</html>